[
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1746056010.770019",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EPCOR Utilities Inc\",\n    \"component\": \"AEM Form Submission - Large Attachments\",\n    \"question\": \"Forms with large attachments are failing in submission. They are using FDM that submits to a Sharepoint Online list. Exception: String value length exceeds the maximum allowed.\",\n    \"answer\": \"This is not an AEM Forms-specific configuration but a default in the Jackson parser used by AEM. There is no exposed configuration in AEM to set a larger value for the Jackson max string length constraint.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1745935493.540289",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"GOVERNMENT OF YUKON\",\n    \"component\": \"Text Box Field - Foundation Components\",\n    \"question\": \"The customer reported an issue where the 'Text Box Field' components in AEM Forms are missing the option to allow users to enter multiple lines of text. This feature is essential for their authoring team. The issue is observed across all environments: Dev, Stage, Prod. This used to work earlier and now not showing the option on new forms. The customer uses Out of the Box Foundation components and there is no customization done for the components.\",\n    \"answer\": \"Issue Reason : ${body.actions[0].selected_option.value}\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1745935004.301239",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"core components\",\n    \"question\": \"The customer received a notification from Adobe regarding the automatic upgrade of core components. They are advised to update their custom code to ensure the success of their cloud pipeline. They do not see the line mentioned in the link as part of their custom code and are unsure about the import package statement that needs to be added in the core pom.xml file.\",\n    \"answer\": \"The line mentioned is not expected to be part of custom code as they are template placeholders replaced during the project generation using the archetype. You need to add the following line to the `core/pom.xml` file: `Import-Package: javax.annotation"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1745527422.803859",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Custom Text Component\",\n    \"question\": \"The customer has customized the Text Input Core Component to add the character count feature. When using this Custom Text Component and generating DOR, this custom text Component does not populate on the DOR, but it is available in JSON.\",\n    \"answer\": \"The instance where the issue is reproducible was shared. However, there was an initial access issue with the server, which was resolved. The instance is now working, and the issue can be reproduced.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1745448925.570939",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"General Motors\",\n    \"component\": \"Adobe Experience Manager Forms\",\n    \"question\": \"Too many requests error (429) during deployment. Encountered multiple NullPointerExceptions and AccessDeniedExceptions in the logs.\",\n    \"answer\": \"The issue appears to be related to custom code changes made during the latest deployment. Engineering is requested to further investigate the changes and their impact. Verification with product engineering is needed to confirm if the errors in the custom code could lead to 429 errors.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1745325042.401689",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS - Text Input Core components Customized\",\n    \"question\": \"The customer has customized text input Core component to add a character count in the text input based on the maximum number of characters. They need to know if there is any other way to reset the character count when toggled by a radio button.\",\n    \"answer\": \"To achieve the use case, you need to add two more functions in the textinput.js file: updateValue(value) and setupCharacterCounter() functions.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1745241297.067589",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Discount Tire\",\n    \"component\": \"Forms\",\n    \"question\": \"One of our Customers Discount Tire has reached out to us highlighting the concern that after the update of the latest AEM build '20133', the forms properties view has been broken and the options on the page looks all misaligned.\",\n    \"answer\": \"We have tested this by updating our in-house environment as well as a local SDK setup of the same build version '20133' but we are not able to replicate this in-house. When checking the console logs, we do not see any errors being logged and when checked the Splunk, we only see warnings. We have tried creating new forms and the properties page do not"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1745235768.687679",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Exclude Title from Document of Record\",\n    \"question\": \"In Auto Generated DOR, excluding sub-panel title also hides root panel title\",\n    \"answer\": \"The fix is completed and will be delivered as part of May Release, as confirmed on the above JIRA.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744993491.880979",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"\",\n    \"component\": \"\",\n    \"question\": \"This message was deleted.\",\n    \"answer\": \"This thread has been marked resolved by !\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744754447.359279",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"INTERNAL REVENUE SERVICE\",\n    \"component\": \"Core components\",\n    \"question\": \"Is it possible to directly map a JSON schema element to a core component? If not, why, and is there any workaround?\",\n    \"answer\": \"Yes, aem:afProperties works for core components as well. The documentation was not updated to reflect this. The feature is available for cloud core components but not yet for on-premise (650) components. A ticket has been raised to address this.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744631517.548969",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Forms\",\n    \"question\": \"How can they save the form data for anonymous users? There is a limitation where if an anonymous user navigates through the list of forms using the Search & Lister component and saves a form as a draft, that draft is not listed by the Drafts & Submissions component. To view drafts and submissions, users must be logged in at the time of form submission. They are also wondering if there is any other solution or best practices Adobe can suggest.\",\n    \"answer\": \"Presently, Portal only lists drafts for logged-in users. We can discuss customization options to achieve this for anonymous users. We will"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744631160.830719",
    "source": "slack",
    "messages": "```json\n[]\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744577450.458019",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"DoR\",\n    \"question\": \"Queries regarding the hidden/read-only fields in DoR. Customer wants to exclude hidden and read-only fields from the DoR event.\",\n    \"answer\": \"The `excludeHiddenFields` feature is under development. For excluding read-only fields, there is no development plan yet, and an FPR would be required. The hidden fields issue is being tracked under Jira ticket FORMS-18005.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744373444.491699",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Multiple Companies (State of Pennsylvania, Bank of Thailand)\",\n    \"component\": \"Forms\",\n    \"question\": \"Package com.adobe.cq.forms.core.components.models.form;version=[5.2,5.3) in start level 20 but no visible bundle is exporting these. Is it expected for customers to update their code before upgrading to the latest release?\",\n    \"answer\": \"Yes, this is a known compile-time issue. Customers have been informed to update their code accordingly by referencing changes in the provided PR link. Some customers have already made the changes, and for those who haven't, there are tickets in place to follow up.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744290333.232339",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Abbvie Commercial\",\n    \"component\": \"Cloud Manager Pipeline\",\n    \"question\": \"One of the customers in the Cloud Manager have two GIT repositories: admp-oak and aem-forms-cloud. When the customer is changing the repo in the pipeline from aem-forms-cloud to admp-oak or admp-oak to aem-forms-cloud, it overrides each other's code. Looking for confirmation if it is the default behavior or if this can be achieved.\",\n    \"answer\": \"Cloud Manager pipelines are generally designed to deploy code from a single repository at a time. Yes, this is a default behavior. If both repositories need to be deployed together, then merging the code"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744193090.549369",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adaptive Form Text Component\",\n    \"question\": \"Facing issues with the Adaptive Form text Component. Tried applying the forward etc mapping on the website. When the website directly uses the wcm text component, then the mapping works. However, when the mapping is applied to the Adaptive Form Text component, it does not work.\",\n    \"answer\": \"Create a sample etc mapping on the site. Sharing a recording that, when hitting localhost:4502, will redirect to the website. Also, the etc mapping details of the crx and wcm components used.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1744145285.107469",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Discount Tire\",\n    \"component\": \"adaptive forms\",\n    \"question\": \"Update to adaptive forms broke our forms\",\n    \"answer\": \"The issue occurred after updating the AEM cloud environment to a recent version, which affected the functionality of the forms. The customer requested a rollback to the previous version of Cloud and the core component in the production environment to make the forms functional again. The issue was resolved after the release was rolled back. Additionally, it was advised to create a custom view for their component to prevent such issues in the future. The customer also had concerns about all environments being updated simultaneously without prior notification, which was explained as part of the automatic updates process in Adobe's AEM as"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743791895.903519",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"Environment Domain Change\",\n    \"question\": \"The Cutover for DMP has been completed, and testing was successful. From a Non ES environment to ES environment.\",\n    \"answer\": \"This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743779314.826839",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"IRS-Support\",\n    \"component\": \"Core component\",\n    \"question\": \"Core component based Text input field requires Display pattern type similar to foundation ones like PhoneNumber, SSN, Zipcode, etc.\",\n    \"answer\": \"Logged a FPR for the same as confirmed over the thread by Rishi: https://jira.corp.adobe.com/browse/FORMS-19439\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743706646.725519",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SmartDocTech-AFC-Beta\",\n    \"component\": \"Theme creation\",\n    \"question\": \"Issue with creating custom themes using shared themes on the repository. Errors observed while deploying themes. Customer hasn’t executed `npm install` before running the build.\",\n    \"answer\": \"It would have been ideal to try executing `npm install` before running the build as outlined in the following link: <https://github.com/adobe/aem-forms-theme-canvas?tab=readme-ov-file#build>.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743697242.939659",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"SharePoint List and attachments DOR\",\n    \"question\": \"Customer wants to confirm they cannot see DOR being sent via SharePoint List connection. Retrieving attachments on SharePoint list for an ID does not prepopulate on the form.\",\n    \"answer\": \"This issue has been fixed and is part of current sites+forms release 20133. If the customer upgrades to that version, the issue will be resolved once the FT is toggled on. As discussed, you will validate if the SharePoint List would be able to use the Custom Clientlibs to attach an attachment on the fly and will confirm.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743692400.846039",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"General Motors\",\n    \"component\": \"Adaptive Form Embed Component\",\n    \"question\": \"Validations not working with the embedded form. None of the out-of-the-box validations fire and the submit button does not work.\",\n    \"answer\": \"Ensure the Forms runtime client library is included as outlined in the documentation. A quick connect was done to investigate the issue and found that the submit action was not configured and there was a runtime dependency missing in the template. A new template was created to avoid overriding existing templates, and form submissions are now working. The form embedded in the page can be checked at <http://forms-team-win:4502/content/wknd/language-masters/en/page-with-"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743689049.857879",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"DoR\",\n    \"question\": \"DOR generated does not pick up the font color for content and unable to control font size. Customer is interested to know how to manage the fonts for the actual content and its size in DOR.\",\n    \"answer\": \"Custom template can be used for this use-case. Customer can create a template in which they can specify their specifications for all the components, and DoR will be generated as per template. Setting the font color only changes partially on the DOR and the body content does not get updated by the change. Custom templates aren't supported for core components yet. We should have documentation outlining exactly what"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743678649.662889",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"Forms\",\n    \"question\": \"Form submissions giving 500 error on stage environment while working fine on dev publish environment. The issue persists specifically with forms that have Document of Record (DoR) enabled.\",\n    \"answer\": \"The issue was identified with the Document of Record (DoR) enabled forms due to an access token error and keystore misconfigurations. Deleting the keystore allowed the initialization logic to configure the keystore correctly on subsequent pod restart, resolving the issue for most forms. However, two forms still failed on Stage Author and Stage Publisher due to additional errors. Ultimately, all forms were validated and confirmed to be working across all environments"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743600228.194799",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SANTANDER CONSUMER USA Inc.\",\n    \"component\": \"Stage Environment\",\n    \"question\": \"The customer needs their Stage only (Not Prod) environment to be upgraded to version 2025.3.19823.20250304T101418Z. Without testing in the stage environment, the customer doesn't want to upgrade the prod version.\",\n    \"answer\": \"Logged a Jira CSMEOPS-8033 regarding the Stage Only Upgrade. This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743195022.890109",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EPCOR UTILITIES INC\",\n    \"component\": \"Forms\",\n    \"question\": \"Forms that send attachments to Sharepoint Online list items failing when files have special characters in them\",\n    \"answer\": \"This issue is similar to one reported earlier (https://jira.corp.adobe.com/browse/FORMS-18214) and will be fixed in the coming sites+forms release.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743096462.065599",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adaptive Form Core Components (Adaptive Form Submit Button)\",\n    \"question\": \"The customer is getting an error while using the Adaptive Form Submit Button and wants to modify the status codes based on their needs.\",\n    \"answer\": \"The engineering team proposed to move to Custom Submit Action instead of a Custom servlet deployed on AEM. The customer accepted this solution. Later, the customer wanted to modify the status codes, but the engineering team suggested that they cannot be modified. The customer wants custom responses from 200 to 500, either through the custom servlet or the proposed custom action. The case was marked resolved after suggesting that a response code can still"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1743089189.116599",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Jackson National Life\",\n    \"component\": \"Forms\",\n    \"question\": \"Cannot view/add all necessary permissions in our PROD tenant. The customer is able to add and provision users in our Stage Region, but when provisioning users in the PROD region they are not able to view/add the groups forms-users and fdm-authors. Typing in 'form' or 'fdm' in the group search brings back no results.\",\n    \"answer\": \"The production instance did not have forms enabled because the production pipeline did not run completely. After running the production pipeline, the forms options and forms groups appeared. This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742976983.256459",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EUROPEAN BANK FOR RECONSTRUCTION\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Customer is encountering issues with extra submit button, CSS conflicts, and CAPTCHA accessibility in AEM Forms v2.1.0 template.\",\n    \"answer\": \"For the hidden submit button issue, add `aria-hidden=\\\"true\\\"` to the element. For the `.hidden` class conflict, recommend dynamically removing and adding the class as needed. For CAPTCHA accessibility, further details are needed, including the type of CAPTCHA and mode used. For CSS overrides, suggest creating a custom theme to avoid conflicts with the form's default styling.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742857348.638009",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"GOVERNMENT OF YUKON\",\n    \"component\": \"AEM Sites\",\n    \"question\": \"Customer is enquiring if there is a way to avoid screen reader text being appended to links inside the embedded form from their AEM Sites pages for regular users.\",\n    \"answer\": \"The issue can be handled using the standard SITES documentation, and the approach described in the shared link will work equally well for forms. It wouldn't affect users in accessibility and will still highlight that it will open in a new tab.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742856637.030169",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"STATE OF MINNESOTA DEPARTMENT-support\",\n    \"component\": \"Adaptive Form File Input\",\n    \"question\": \"Requirement that users be able to drag and drop attachment onto the file attachments button.\",\n    \"answer\": \"The property 'dragDropText' is exposed in v2 but not in v3. Adding the 'cq:template' from v2 to v3 resolves the issue.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742642654.368639",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Forms\",\n    \"question\": \"Facing issues while traversing to different fields in their forms with a keyboard. For submitting the form, when traversed with keyboard to the Submit button, it is working with SPACE key but not with ENTER key.\",\n    \"answer\": \"This was fixed as part of version 3.0.70. It is suggested to upgrade the core component to version 3.0.104 to resolve this issue.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742585912.425199",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"KOMATSU AMERICA CORP\",\n    \"component\": \"Forms\",\n    \"question\": \"Rules on the forms are not executing\",\n    \"answer\": \"The customer has created a copy of the runtime base library, which is not recommended. Deleting the overridden node `/apps/copapwp-adaptive-form-components/clientlibs/fd/af-clientlibs/core-forms-components-runtime-base` should resolve the issue. Ensure to include the Forms runtime client library when embedding Forms into AEM Sites pages.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742490887.360669",
    "source": "slack",
    "messages": "{\n    \"company\": \"United Health Group\",\n    \"component\": \"AEM forms cloud\",\n    \"question\": \"The customer is seeing different create data source config UI options for new and old AEM forms cloud programs, although AEM Forms releases are the same on both programs.\",\n    \"answer\": \"The difference between the new environment and old is that new environments have enhanced security. After enabling the Early Adopter Program, the service Endpoint options are available.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742474895.914619",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Acrobat Sign and Scribble\",\n    \"question\": \"The customer is not able to scribble sign or Adobe Sign Component with a Core Component based Form in AEM Forms as Cloud Service.\",\n    \"answer\": \"Both Adobe sign and Scribble signature are not yet available in the core components which is why this option is not appearing. This seems like an FPR, please capture the details and log a jira. Thanks for the confirmation. A Feature Pack Jira has been logged: https://jira.corp.adobe.com/browse/FORMS-19264. For scribble: https://jira.corp.adobe.com/browse/F"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742473719.982259",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS - Forms Customization of core form components\",\n    \"question\": \"The customer has created a custom implementation of a character counter for text areas and text fields. The need for a character counter to show the number of characters entered by the user, and shared a GitHub link provided by Adobe for the implementation. The out-of-the-box character counter did not work well in the current scenario and a custom implementation was needed to meet the requirements. The customer needs confirmation from Adobe to proceed with the chosen approach and help with the issue.\",\n    \"answer\": \"Granite.I18n is not exposed during runtime, causing an error"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742451413.060049",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"AEM Forms Theme Canvas\",\n    \"question\": \"The customer has reached out to us stating that one of the JS dependencies is classed as vulnerable. The dependency in question is browser-sync which has a dependency on eazy-logger. eazy-logger:4.0.1 is having vulnerability issues reported as CVE-2024-57075. The customer would like to know what recommendation Adobe has to resolve this vulnerability as browser-sync is being used in the default theme AEM Forms Theme Canvas. The customer wants to understand what browser-sync is being used for in the AEM Forms Theme Canvas, so that they can determine if the dependency is"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742218046.345589",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"GOVERNMENT OF YUKON\",\n    \"component\": \"Template Policy in AEM Forms\",\n    \"question\": \"The customer mentioned that they cannot get to the usual config page as they mentioned that it got changed with the latest deployment? The customer wants to know how they can declare the clientlib dependencies under the new layout?\",\n    \"answer\": \"We don’t support Page Policy in Blank Adaptive Forms (AF) for foundation components. This behaviour is as designed.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1742201428.909459",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANCOLOMBIA\",\n    \"component\": \"Timeline Feature in AEMCS Forms\",\n    \"question\": \"Bancolombia, a key AEMCS Forms customer, is unable to enable and use the timeline feature with forms. The customer has admin permissions, but when they attempt to use the timeline feature, they receive the following message: 'The timeline is not available for the selected.'\",\n    \"answer\": \"The timeline feature is an existing feature without any feature toggle (FT). Enabling the FT_FORMS-10091 toggle displays the timeline. Commenting becomes visible only once the customer starts the review. The issue was that the toggle wasn't enabled during the setup, which is"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1741383660.708629",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"IRS\",\n    \"component\": \"Adaptive Form Core Component\",\n    \"question\": \"Is it possible to use both foundational components and core components in Core component-based AF to reuse their already made custom components?\",\n    \"answer\": \"No, foundation components are not supported in core component-based forms.\"\n},\n{\n    \"company\": \"IRS\",\n    \"component\": \"Adaptive Form Core Component\",\n    \"question\": \"How to manage components such as Table component as well as properties like Display pattern when creating AF based on Core component?\",\n    \"answer\": \"displayPattern is supported through displayFormat. If the table component is being used solely for layout purposes, consider using the grid component. If the table is"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1741381776.194099",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"General Motors\",\n    \"component\": \"Pipeline\",\n    \"question\": \"Program 1 DEV/SIT deployment failing. JSPs related to forms were not being found.\",\n    \"answer\": \"The issue seems to be isolated as the pipeline with the same code works now. The `guidesglobal.jsp` file is located inside AEM at the specified path. Recommend reaching out to the Cloud Manager team for further details. A JIRA has been logged with the Cloud Manager team, marking the thread as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1741345975.762429",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"Forms Manager\",\n    \"question\": \"Our customer Deloitte encountering an error message where the software generates an error message that includes sensitive information about its environment, users, or associated data. The application is failing to properly handle the errors and exposing the sensitive information in the response.\",\n    \"answer\": \"The error message is just providing the information about the path being passed as formsPath, no other sensitive information being exposed. Please log a Jira issue for component Forms Manager, we will get this evaluated from the security team as well and improve as per the suggestions.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1741300042.029759",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adaptive Form Text Core Component\",\n    \"question\": \"Customer is facing issues regarding the RTE and link configuration. Specifically, URL mapping is not kicking in and links do not open in a new tab.\",\n    \"answer\": \"You have to select target as new tab while configuring the link.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1741205478.895419",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EPCOR UTILITIES INC\",\n    \"component\": \"SharePoint List Connections\",\n    \"question\": \"Can't create SharePoint List Connection in AEMaaCS version 2025.1. The Connect button is enabled after entering the client id, secret, and endpoint but does not open a new window for the Microsoft OAuth connection.\",\n    \"answer\": \"This is a regression, and the fix will be delivered in an upcoming Sites + Forms rotary release. In the meantime, disable the feature toggle to restore functionality. The fix will be part of the 2025.04 release. JIRA reference: https://jira.corp.adobe.com/browse/FORMS-18480\"\n}\n"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1741030134.737429",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEM Form - Custom Adaptive Form Submit\",\n    \"question\": \"The customer is trying to change the status code and message, but they are always getting the 500 error if form submission failed. The customer has a requirement to send API status code (200/20/404) to front end to show the error message to user.\",\n    \"answer\": \"By default, you cannot send a custom HTTP response code to the front end if the submission fails externally (i.e., within a custom submit action). The response code returned to the user is always 500. However, the response payload includes a serialized JSON of `guideValidationResult"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1740768480.230779",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Jackson National Life\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"The customer is trying to add Jackson specific fonts in our AEM Cloud Service Adaptive Form and followed the steps mentioned in the article but still not able to see our fonts in the theme editor section.\",\n    \"answer\": \"The customer did not see the fonts because of the incorrect configuration of the project and their instance is on the older version. Also, when adding the external font, the fonts need to be added to the Adaptive Forms Theme Configuration for it to be visible. In the customer's Cloud Dev environment, the use case was working.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1740726050.711709",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SIGNAL IDUNA LEBENSVERSICHERUNG\",\n    \"component\": \"Experience Manager\",\n    \"question\": \"Browser explorer breaks when navigating upwards. The browser becomes unresponsive upon clicking the upward navigation, affecting all environments.\",\n    \"answer\": \"This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1740392190.281359",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Security Testing - File Upload Functionality\",\n    \"question\": \"When you submit a form with an attachment and intercept the call, by changing the content and extension of the attachment the form is submitted which is malicious behavior.\",\n    \"answer\": \"The issue was tested on the latest cloud instance and did not reproduce. It was noted that submission passes for core components as the system currently doesn’t validate the file attachment mime type on the server. A JIRA ticket (FORMS-19236) has been created to address this issue.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1740140852.888599",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SIGNAL IDUNA LEBENSVERSICHERUNG\",\n    \"component\": \"Adaptive Form Preview Configuration\",\n    \"question\": \"Issue with theme becoming inaccessible after deleting the selected adaptive form for preview.\",\n    \"answer\": \"This behavior is expected as theme rendering depends on the associated form. You can log a Jira issue for enhancement to fallback on a default form. A bug has been logged at https://jira.corp.adobe.com/browse/FORMS-18969.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1740139026.019399",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SIGNAL IDUNA LEBENSVERSICHERUNG\",\n    \"component\": \"AEM Forms Themes\",\n    \"question\": \"Our customer SIGNAL IDUNA LEBENSVERSICHERUNG A.G encountering an issue where after creating a Theme, author cannot change the 'Base Client Library'. The Theme configuration window has a 'Base Client Library' option, on updating the base client library, though it updates in the CRX/DE but the UI doesn't shows updated library.\",\n    \"answer\": \"The issue seems to be caused by a broken POST call due to a security fix that is encoding JSON, leading to a parsing exception. This prevents the dependencies property from being set on the node. A"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1739880294.668499",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANCOLOMBIA\",\n    \"component\": \"Button in Headless forms\",\n    \"question\": \"No se guarda regla en componentes Button en formularios Headless\",\n    \"answer\": \"The Rule editor is working correctly with all the components. The issue is related to the custom function created by the Adobe Consulting team. Customer will follow up with the Consulting Team on the function.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1739861044.908919",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Colonial First State\",\n    \"component\": \"CFS Forms\",\n    \"question\": \"CFS adaptive forms using REST API with POST Servlet stopped working after a recent cloud instance upgrade. Form submissions fail with 500 Internal Server Error.\",\n    \"answer\": \"Upgrade the core component version on the instance to resolve the issue. If the customer is unwilling to upgrade, roll back to the old release by submitting a SKYOPS ticket. The customer should update to version 2.0.64 where the issue would not be seen. Rollback request logged: SKYOPS-97263.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1739828212.487609",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIV OF TEXAS AT AUSTIN DELL\",\n    \"component\": \"Form Data Model (FDM)\",\n    \"question\": \"Not able to access Form Data Model's JSON schema to feed to the React Adaptive Forms component. They have successfully loaded and displayed the form model JSON locally but are struggling to pull the dynamic JSON from the API. They have tried various endpoints but have not been able to get the required JSON for the adaptive forms component.\",\n    \"answer\": \"Form Model JSON is accessible via the following API (under getFormDefinition tab) https://developer.adobe.com/experience-cloud/experience-manager-apis/api/stable/forms/\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1739796111.209109",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EUROPEAN BANK FOR RECONSTRUCTION\",\n    \"component\": \"SharePointList\",\n    \"question\": \"The customer mentioned that they have followed the steps below to submit the data to SharePoint. All the things are working fine as expected in the develop environment. When the same is taken forward to a higher environment they are facing an issue. The issue we are seeing is that when clicking the connect button in the Microsoft SharePoint Configuration in AEM nothing appears to be happening. The customer also mentioned that they are now seeing the same issue in the dev environment. They have checked and the ClientID, secret, and authurl as set in the Microsoft SharePoint configuration is correct in all environments"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1739785492.873529",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMforms\",\n    \"question\": \"Current date function returns invalid date. On initialize, the date is showing a date earlier than today on customer's instance.\",\n    \"answer\": \"The issue was fixed a while ago. Please try it with the latest core component release; the issue should no longer be reproducible.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1739784783.940379",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"DoR\",\n    \"question\": \"Intermittent error while generating DOR connected to SharePoint. The form fails continuously with certain set of attachments and shows errors related to DocService connection.\",\n    \"answer\": \"The issue is due to the `formsdocservice` pod not being available during invocation. The dev environment has limited resources, and large attachments (20MB) are prone to failure. It is recommended to test on stage environment where resources are more adequate.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1738958251.296489",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"Forms\",\n    \"question\": \"Copy Paste Forms Failing in Dev and Stage\",\n    \"answer\": \"In the DEV environment the use case is working correctly, and in Stage, it was throwing an error. DEV and Stage are on different versions. You will be upgrading your Stage environment to remove the error.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1738943714.667589",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEM Step/Progress Indicator\",\n    \"question\": \"Accessibility and operability issues with the AEM Step/Progress Indicator, including problems with semantic roles.\",\n    \"answer\": \"The form was found to be blank without a theme. A sample form was tested with NVDA for accessibility, and it was observed that the NVDA correctly read the form. The observations were confirmed with the customer, marking the issue as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1738693153.711759",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Accessibility\",\n    \"question\": \"File Upload missing role of button. Attach button is wrapped in a <label> element and is not read as a button by screen reader users.\",\n    \"answer\": \"Adding a role of button to the <label> should resolve the issue. This is already fixed and documented as part of v3 version of file input. Received confirmation from the customer that the issue is resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1738630317.009259",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Repeatable Panel\",\n    \"question\": \"Customer is trying to add a repeatable panel inside another repeatable panel, but the layout does not span as expected. The subpanel gets inserted after the second instance of the main panel instead of inside the current instance.\",\n    \"answer\": \"The issue was identified as a problem with rule generation in the JSON, always adding the subpanel at the end of the last instance of the panel. A custom function was provided to dynamically get the target panel, which was implemented and updated on the shared instance. The solution was verified and confirmed to work.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1738342524.899589",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Parcel Service\",\n    \"component\": \"AEM Upgrade Issue - Version 2024.11.18751.20241128T090041Z\",\n    \"question\": \"Captcha getting picked up from Parcelpro rather than Insureshield site.\",\n    \"answer\": \"After changing the recaptcha configuration for the form, the correct site key is getting picked up. Ensure that the relevant configuration container is selected: global for the Insureshield form and Parcelpro for the Parcelpro forms. The customer should also test this workaround on the stage environment and consider creating a dedicated configuration container for their sites. Engineering will investigate the issue further.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1738103872.448509",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Sterling Jewelers, Inc.\",\n    \"component\": \"Watermark Workflow model\",\n    \"question\": \"Fonts are missing from the 'Font' dropdown menu on the 'Arguments' tab within the watermark workflow model when a step is executed. Is there a specific setting that needs to be enabled to access the built-in out-of-the-box fonts?\",\n    \"answer\": \"The workflow step is owned by the Assets team. The issue has been marked as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737993450.971979",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"ServiceNow DXP\",\n    \"component\": \"WCM Core Component\",\n    \"question\": \"We're planning to upgrade WCM Core components bundle version to v2.25.4 on AEM SP20. We want to know if this version 2.25.4 is compatible with AEM Forms core components version.\",\n    \"answer\": \"WCM version 2.24.6 is supported with the latest core components version 1.1.64 and also the version 1.1.39-enumB010 which you are using. As of now, WCM v2.25.4 is not compatible with the core components so we would suggest not to upgrade it.\"\n"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737983084.725979",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Accessibility\",\n    \"question\": \"Checkboxes not grouped. One of the customers highlighted the accessibility concern related to the Checkboxes. They encountered the same issue with the radio button group as well.\",\n    \"answer\": \"1. Checkboxes must be grouped in a <fieldset>. 2. The group label must be nested in a <legend>. 3. The <legend> must be the first child element of the <fieldset>. Logged an FPR <https://jira.corp.adobe.com/browse/FORMS-18211>. Marking this as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737982059.977809",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Radio Button Help Text\",\n    \"question\": \"When the customer is using the Radio Button Help Text Option and adding a long Text with some of the text is bold then the help text is not coming up correctly. This is reproducible at our end.\",\n    \"answer\": \"This is a bug, could you log a ticket and assign it. Seems like change needs to be done here: https://github.com/adobe/aem-core-forms-components/blob/master/ui.frontend/src/view/FormFieldBase.js#L626. A Jira ticket has been logged: https://jira.corp.adobe.com/browse/FORMS-18283"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737980958.019239",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Attachment Name in Adaptive Form\",\n    \"question\": \"When submitting a form with an attachment, the attachment name is stored as attachment-0, attachment-1, etc. rather than the PDF name or the file name of the attachment.\",\n    \"answer\": \"This is working as designed with the attachment stored with the name attachment-0, attachment-1, etc. If needs to change, we need to log a FPR request. A FPR Jira has been logged for the issue.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737758931.422679",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Government of Yukon\",\n    \"component\": \"AEM Forms and SharePoint Integration\",\n    \"question\": \"The submission process fails to save the file when a user tries to submit a Mac screenshot to AEM Forms, which is connected to a SharePoint list. The file attachments are lost due to a narrow non-breaking space in the filename produced by MacOS.\",\n    \"answer\": \"An enhancement JIRA, FORMS-18214, has been logged to handle this issue. The problem requires enhancements in the product to handle the narrow non-breaking space in filenames.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737598965.651749",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NFL\",\n    \"component\": \"Forms\",\n    \"question\": \"401 Unauthorized while submitting the form. One of our Customers NFL has raised a concern where they are facing issues while trying to submit a form. They are having a custom submit action which is supposed to pick up the attachments from the form fields on publish and upload them into Author's DAM. To achieve this, team has written an upload API which makes an access token call (via a cloud manager API in Developer console) first to authenticate and then creates a folder and upload the assets. Currently, this is failing with error 401 Unauthorized, though customer confirmed that it was working when instead of passing the client id and client secret to make use"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737496927.396999",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms and Signing\",\n    \"question\": \"Customer's expectation is for us to enable the RUM library on their DEV cloud instance. Once this is done customer will test their code to see if there are any issues or not. If there are no issues, no further action is needed however if any issues are seen, they will need Adobe to disable the library again.\",\n    \"answer\": \"This was addressed via <https://cq-dev.slack.com/archives/CUB9NMJ72/p1737572055308699>. This thread has been closed by ! No further action is required.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737174042.607599",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EUROPEAN BANK FOR RECONSTRUCTION\",\n    \"component\": \"Forms\",\n    \"question\": \"Unable to access the form data on publish instance. The customer wants to save end user data in publish instance of a forms cloud service instance. Is there a possibility to get an exception to store data in tenant specific storage?\",\n    \"answer\": \"We have informed the customer that publish instance is not writable in cloud service and PII data shouldn't be stored in cloud instance. We directed them to use external data store as outlined in our documentation. Storing PII data in AEM is not a good option. They can store in various storage options including SharePoint, BlobStore, Salesforce, MS"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737051858.385459",
    "source": "slack",
    "messages": "{\n    \"company\": \"State of Pennsylvania Office of Administration\",\n    \"component\": \"Radio button\",\n    \"question\": \"The customer highlighted the concern regarding the accessibility of the Radio Buttons. Specific issues include: Radio button group must be grouped in a fieldset, the group label must be wrapped in a legend, the invalid role of radiogroup aria-label on the div containing the radio buttons must be removed, the aria-label attributes on the input elements must be removed, and radio button labels are not being read by screenreader.\",\n    \"answer\": \"The issue has been acknowledged and a Jira ticket (FORMS-18057) has been raised for further analysis. The changes proposed are not just limited to ARIA tags but also involve"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1737001037.736389",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"helium APAC\",\n    \"component\": \"Adaptive Forms in Universal Editor\",\n    \"question\": \"Issue in authoring adaptive forms in universal editor. The customer is getting a popup 'Unable to add content' and the logs show an error related to SlingRequestPathInfo and FormStructureParser.\",\n    \"answer\": \"Ensure that forms core components are enabled to be added through the customer project. The steps can be referenced from https://experienceleague.adobe.com/en/docs/experience-manager-cloud-service/content/forms/setup-configure-migrate/enable-adaptive-forms-core-components.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1736872369.741679",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"DoR\",\n    \"question\": \"The customer reported the text which is highlighted as bold is coming </b> in the DOR when using the rich text field and then bolding those fields.\",\n    \"answer\": \"The issue was reproducible and logged as a bug in the Adaptive forms Runtime. The limitation in the output service needs confirmation, and the customer is advised to move to the latest forms addon.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1736870783.907119",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State of Pennsylvania Office of Administration\",\n    \"component\": \"AEM FORMS - DOR\",\n    \"question\": \"With DOR generation and loading DOR in SharePoint, if there is a disabled field with a default value, it crops up in DOR. However, if the disabled field was set by the dermis API using invoke service, the disabled field shows nothing. Customer sees a way to hide hidden fields from DOR but wants to confirm if it is doable for disabled fields. Adding an onchg event to a new text field to update a hidden field's value and disabled field's value results in the disabled field's value updating in UI, but DOR only contains the up"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1736779069.006129",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adobe Experience Manager Forms\",\n    \"question\": \"Issue with Email Submission when 'Include Attachment' is checked. Error: Could not create email for form.\",\n    \"answer\": \"Customer was recommended to upgrade to the latest version. After upgrading, the issue was resolved and confirmed by the customer.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1736520830.022419",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS SharePoint and Forms Connector\",\n    \"question\": \"The customer has a SharePoint Forms AEM connector and has observed that files >20 MB throw errors when the number of files increases. They have a use case of 100 MB files and 20 of them, which did not scale well, resulting in a null pointer error. Is there a limit on the number or size of attachments? If not, why is there inconsistent behavior and a NullPointerException?\",\n    \"answer\": \"The CDN times out after 60 seconds, causing 503 errors when handling large payloads, as the UI thread remains blocked waiting for"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1736405902.529579",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"Adobe Marketing Cloud\",\n    \"question\": \"Revalidate on server fails with scripts. The customer has a script validation in a DoB field. The validation fails when the form is submitted with 'Revalidate on server' enabled. Form submission is successful if the validation is disabled with 'Revalidate on server' enabled. Form submission is successful if the validation is enabled with 'Revalidate on server' disabled.\",\n    \"answer\": \"The customer's script uses HTML functions that will not run on the server. An alternative is to use a custom widget. Testing this approach is suggested before sharing it with the customer.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1736302787.260449",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NFL\",\n    \"component\": \"Core Component\",\n    \"question\": \"Core component based scripts are failing while loading the form in publish. The issue only occurs in publish, Author is working fine and no console logs are observed. The error observed is 'Uncaught (in promise) TypeError: Cannot read properties of null (reading 'properties')'. The formJson wasn’t fetched during the render, causing the failure. The dispatcher blocked the request for 'licensee-application/jcr:content/guideContainer.model.en.json' resulting in a 404 status code.\",\n    \"answer\": \"The issue was resolved by reviewing and updating the customer's dispatcher filters. The path '/content/licensee-application"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1736173964.900059",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EUROPEAN BANK FOR RECONSTRUCTION\",\n    \"component\": \"AEM Forms email template\",\n    \"question\": \"The Customer is using AEM as a Cloud service and are building adaptive forms and using OOTB email submission with some email template. When they try to use html template for the OOTB email functionality, the conversion of html tag didn't happen and the inline styles also not applying for the email content and they get the entire HTML content on the email without any styles.\",\n    \"answer\": \"We don't support HTML template in email, as of today. Though this feature is being added, and will be available on cloud for core components for Feb release.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1735318777.921849",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"GOVERNMENT OF YUKON\",\n    \"component\": \"AEM Forms as a Cloud Service\",\n    \"question\": \"Details about the translation in AEM Forms as a Cloud Service, specifically regarding xliff for human translation.\",\n    \"answer\": \"For Core Components forms, set human translation as documented. A dictionary containing files in XLIFF format is shared with professional translators. The dictionary includes a separate XLIFF file for each locale. Steps are documented in the provided links.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1734671028.620669",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"GOVERNMENT OF YUKON\",\n    \"component\": \"Microsoft SharePoint List\",\n    \"question\": \"Create Microsoft SharePoint List fails with 500 error. The 'Sharepoint list' field never populates, displaying an 'ERROR' message. POST call failing with 500 server error.\",\n    \"answer\": \"Please check if the user creating the cloud config is added as an owner/member to the SharePoint site. Verify if the customer is able to see the SharePoint sites via Graph APIs. Check if the site permission is set to Private or the user needs to be added to any group. A debugging session has been scheduled with the customer to address the issue.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1734634972.461899",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NAVY FEDERAL CREDIT UNION\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer is experiencing issues in their Production Author and Publish environments related to AEM Forms. The issue is the failure of the letter generation process using the Output Service, resulting in no letters being generated.\",\n    \"answer\": \"Investigation found a significant number of 409 errors followed by 400 Bad Request errors. The server attempts to validate a token but encounters an 'invalid token' error, which appears to be directly related to the Output Service failure. This issue seems specific to the customer's instance and does not indicate a global outage. Engineering is requested to help understand why the Production was restarted at 11 AM"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1734584199.190459",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"HYUNDAI CAPITAL SERVICES\",\n    \"component\": \"Security Incident\",\n    \"question\": \"One of our customers reported a security concern where their AWS security team informed them that S3 Secret keys at Adobe Stage account were compromised. They managed to change it with new values with our help but want to investigate further. Is Adobe using TruffleHog or any bot scan?\",\n    \"answer\": \"Please raise this issue on the #C0AT61VED channel. Tag me there and I will follow it up with AEM Security team.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1734016849.890099",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"HYUNDAI CAPITAL SERVICES, INC.\",\n    \"component\": \"Cloud Manager Production Deployment Pipeline\",\n    \"question\": \"Production Deployment Pipeline via Cloud Manager failing at Mutable Content Job due to 'BlockedQueue' error during the deployment phase.\",\n    \"answer\": \"Raised issue <https://jira.corp.adobe.com/browse/SKYOPS-92371> to address the problem. The thread is closed and marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1733821899.904889",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Help Text on Radio Button\",\n    \"question\": \"The customer wants the help text content to be available on the individual radio button item. Does Adobe plan to bring about options to add help text (little info icon) beside each radio button option, now or in upcoming releases?\",\n    \"answer\": \"You can create a custom component for this, but we can provide a sample if needed. We do not plan to include this in the product in the current plan. You could do the following, <https://github.com/adobe/aem-core-forms-components/pull/1496>, to include custom help text with individual radio button."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1733801540.878749",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"MAURICE BLACKBURN PTY LIMITED\",\n    \"component\": \"Text component\",\n    \"question\": \"Text component content is not showing on the AEM Form, and the content is replaced by an empty string. The issue is intermittent on Author and persistent on Publish instance.\",\n    \"answer\": \"The issue was occurring intermittently because the component had 'Hide title' marked as yes. Once this was marked off, the URL was visible on the publisher. The problem was resolved after this adjustment.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1733754285.486679",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Previewing Content Service in AEM Forms\",\n    \"question\": \"The State Of Pennsylvania Office Of Administration highlighted the concern while using the Previewing Content service. As per the documentation, the functionality is for the AEM Sites. However, they are using it for the AEM Forms. The customer is on 2024.11 and for the AEM Forms they are not able to see the same in Dev.\",\n    \"answer\": \"The manage publish feature is available as pre-release in 2024.11. The RT_2024.12.0 toggle is not enabled. Once this toggle is enabled, the pre-release feature"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1733348899.008159",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer, Suncorp, is encountering an issue where a user is getting an 'oak access denied' error when copying forms in a specific folder. The user is part of both the administrator and forms-power-user groups and is able to copy and delete forms anywhere else, but in this specific folder, they are encountering the 'oak access denied' error.\",\n    \"answer\": \"The customer might be encountering a known issue FORMS-17036. The fix will be available in the next sites+forms rotary release scheduled in Feb 2025. In the meantime, the customer can apply the following workaround: <https"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1733250432.078149",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANCOLOMBIA\",\n    \"component\": \"Headless forms\",\n    \"question\": \"Internal server error (500) on submitting Headless forms. This issue has been observed across multiple forms.\",\n    \"answer\": \"The issue was due to the custom submission service (com.bancolombia.core.services.BancolombiaHeadlessSubmitService). The customer provided access for further troubleshooting, and the issue was resolved on Dev, Stage, and Prod environments.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1733141954.698429",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AAA Washington\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer is creating simple foundation-based Adaptive Forms, which are completed successfully, however, post creation when they select the form and click on 'Properties', the Properties page shows extra Edit & Preview buttons. Many of them don't work, or function incorrectly. The client has confirmed they have not pushed any custom code / packages from their end.\",\n    \"answer\": \"The problem is specific to their programs, probably because of any mistake they did while upgrading the version. Suggestion is to revert to previous working version & ask them to upgrade again. After running the pipeline for the impacted programs multiple times, the issue persisted. Finally, marking"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1732943273.956509",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Formulari\",\n    \"component\": \"DoR\",\n    \"question\": \"The customer is trying to publish a form titled 'provaMovePanel' but it fails with the DoRTemplateParsingException. Another form on the same instance publishes successfully.\",\n    \"answer\": \"The issue is likely due to unsupported characters in the rich text fields of the form. Specifically, the umlaut character (¨) in the text. Removing unsupported characters should resolve the issue.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1732593496.785839",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Leads Technologies Ltd APAC Partner Sandbox\",\n    \"component\": \"Adobe Sign and AEM Forms Integration\",\n    \"question\": \"Customer is trying to achieve a use case to preview the form (in PDF format) before signing the same (using Adobe Sign). However, the signature step component is not available in AEMaaCS. They are unable to find the signature step component in both old and new versions, but it is available in the on-prem setup. The customer is seeking insight on whether the signature step needs to be enabled explicitly or if it has been deprecated.\",\n    \"answer\": \"The signature step is not available in AEMaaCS. The official documentation shared is for the scrib"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1732552882.837249",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"Forms\",\n    \"question\": \"Testing Failure with Case #E-001334026, customer still facing issue after upgrade to 2024.11\",\n    \"answer\": \"The initial reported copy paste issue has been fixed in the release. Ask the customer to validate by creating a new form and trying copy paste again. A workaround for a specific published core component form issue (FORMS-17036) includes downloading the form, deleting it, and re-uploading it using Forms Manager Console. Ensure to keep an unpublished copy until the fix is available.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1732074602.308239",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SANTANDER CONSUMER USA Inc.\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Santander has a follow-up question from the SOC2 type 2 report regarding the nature of the encryption (algorithm used), keys, whether the keys are unique to Santander or shared between multiple tenants, and if the keys are unique for the Program or environments.\",\n    \"answer\": \"Additional information that was not part of the SOC2 report has been provided via the specified Slack link. This thread has been marked as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1731992424.944509",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"HYUNDAI CAPITAL SERVICES\",\n    \"component\": \"Development Token\",\n    \"question\": \"Development Token not working for STAGE Servers. When making a POST call to External API using Local development access token, they receive an error in the postman response: 'You are not authorized to make this call. Get your access token first.' This issue occurs only for the Local development access token, while the same code works for dev and production with respective tokens.\",\n    \"answer\": \"Local access token should only be used for testing and not in production. Use access tokens generated by technical account and JWT for production. The issue is in the customer’s custom code, and they need to debug their code"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1731955341.704799",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SANTANDER CONSUMER USA Inc.\",\n    \"component\": \"SOC2 Report\",\n    \"question\": \"Customer has reached out to get SOC 2 report for their most current report id for 11/2021 through 10/2022. I see SOC 2–Type 2 (Security, Availability, & Confidentiality) listed for Adobe Experience Cloud but when customer tried with their account, it did not have access. The customer gets an access denied after signing the non-disclosure agreement.\",\n    \"answer\": \"I am able to download the SOC 2–Type 2 (Security, Availability, & Confidentiality) agreement by logging with my ldap in US region."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1731931402.770269",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SANTANDER CONSUMER USA Inc.\",\n    \"component\": \"JWT Migration\",\n    \"question\": \"Does the Adobe Team have an infrastructure in place to track traffic through the API configured in the mentioned project? Can the notification email be safely disregarded, or does it require action?\",\n    \"answer\": \"Yes, it is regarding the JWT to OAuth Migration. The integration listed here is for the Cloud Manager AEM Forms Communications API. I remember they had few integrations created as part of testing in ADC. These can be disregarded. They should delete these integrations to avoid receiving further emails.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1731527892.788459",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms and Signing\",\n    \"question\": \"Unable to log in into DEV environment despite entering correct credentials\",\n    \"answer\": \"Assuming the user has been assigned the correct product profiles for admin/aem user from the admin console. If that's the case and incognito mode is also not helping, it is suggested to log a ticket for AEM security.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1731422761.602369",
    "source": "slack",
    "messages": "Given that the input message contains very limited information and has missing details, it's challenging to extract a complete knowledge triple. However, based on the provided message, here's a JSON object with inferred information:\n\n```json\n{\n    \"company\": \"Unknown\",\n    \"component\": \"Unknown\",\n    \"question\": \"Issue Reason: ${body.actions[0].selected_option.value}\",\n    \"answer\": \"Reference Ticket#: E-001435808\"\n}\n```\n\nNote: The company name and component are marked as \"Unknown\" because the provided message does not contain sufficient information to identify them."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1731074684.622019",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"reCAPTCHA Enterprise (Score-Based)\",\n    \"question\": \"reCAPTCHA Enterprise (Score-Based) is not functioning as expected when attempting to submit a form. The form submission is failing and a console error is displayed.\",\n    \"answer\": \"Updating to the latest version of core components should resolve this issue. The customer has been notified about the same.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1730776532.193309",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte Llp\",\n    \"component\": \"Experience Fragment\",\n    \"question\": \"Upon publishing an experience fragment at the path /content/experience-fragments/digital/languages/en/site-assets/footer/jcr:content, warning logs are generated with messages indicating a traversal query without an index. The customer is concerned that running this traversal query without an index may negatively impact performance.\",\n    \"answer\": \"Logged RFH issue FORMS-17162 to address the problem. The issue has been resolved and marked as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1730496138.697939",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Bancolombia\",\n    \"component\": \"Adaptive Forms\",\n    \"question\": \"The customer is encountering 500 and 503 errors when submitting an adaptive form. They are using a custom submit action that works with other forms but not with this one. Logs show errors related to an invalid datasource configuration, although no FDM is used in the form.\",\n    \"answer\": \"The issue is related to the forms portal post processor getting called to save submit metadata, which is failing at the dermis level. There are two questions to address:\\n1. Are they using foundation component based AF or core component based AF?\\n2. Have they configured USC for the portal? Are they using any"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1730223666.781359",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Investors Group\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"Adaptive form not captured by Analytics. The Adaptive form the customer is using is on AEM 6.5 on-prem, and the analytics cannot be captured since it is within an iFrame. The customer has a query, can have the 'Adaptive Form - Embedv2' for AEM Forms On prem 6.5?\",\n    \"answer\": \"Yes, Embed V2 is supported on AEM 6.5 on-prem. You can download the latest release from this link: https://github.com/adobe/aem-core-forms-components/releases/tag/core-forms-components-reactor-1.1."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1730154257.715679",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Bancolombia\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer is encountering errors while manually deploying forms by making packages in DEV and then uploading them to stage/prod using the package manager. They are also asking for the recommended way to import and export forms in the local SDK to commit them to the cloud git and run pipelines.\",\n    \"answer\": \"Ideally, only code should be deployed through the CI/CD pipeline, while content can be transferred from dev to stage using the forms manager UI.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729881268.300639",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"AEM Server Upgrade\",\n    \"question\": \"The customer does not see 'update' option or 'Update Available' option for STG and PROD environment. Is it a feature that needs to be enabled? Customer saw only for DEV environment but not for STG/PROD ever before in this program. However, customer environment is not updated yet to new release. In case if they like to get that updated how would we go with that?\",\n    \"answer\": \"The customer can't update stage and prod environments on their own. They are auto-updated during every release. It is by design."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729829444.268329",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANCOLOMBIA\",\n    \"component\": \"Forms\",\n    \"question\": \"Unable to edit properties for components pasted from a different Form. The components are Date-pickers or text boxes etc. No critical errors logged but Guidelib errors appear while loading the form.\",\n    \"answer\": \"Logged a bug and provided a workaround. The actual fix is planned to be delivered in 2025.1. Marked as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729757601.180579",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Atco Group\",\n    \"component\": \"SPA Forms\",\n    \"question\": \"SPA Forms error out when the captcha component is on the page. When the component is added, the form errors out.\",\n    \"answer\": \"From the error logs, it looks like the response token is not getting set properly. User has been added and validation on the URLs mentioned above was requested. An IW ticket for tracking purposes was requested and the issue was resolved with Jira ID FORMS-17106.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729662351.011489",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"Adaptive Form Text Component\",\n    \"question\": \"External link redirection not working for Adaptive Form text component using RTE\",\n    \"answer\": \"It is a recent regression due to security fix. Created a PR for it: https://github.com/adobe/aem-core-forms-components/pull/1463 and raised a ticket: https://jira.corp.adobe.com/browse/FORMS-17043. Ensure that DOMPurify can handle all scenarios.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729652029.541979",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"Adobe Marketing Cloud\",\n    \"question\": \"Unable to send Boolean fields from rule set using custom function. The customer tried to send the value as true/false in the parameter of custom function with parameter type {boolean}, because the same function needs to be called twice on one field change this function will be triggered with flag=true and on another field with flag=false. They have raised this issue to achieve above requirement, and it was working fine but stopped working unexpectedly. Can you please confirm if this is possible with custom functions or not?\",\n    \"answer\": \"Any field object can be passed via parameter if param type is {object}, else only field value is"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729565905.021059",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANCOLOMBIA\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"API returns 403 Forbidden when user-agent is 'Mozilla/5.0'\",\n    \"answer\": \"The issue is caused by the ReferrerFilter rejecting empty referrer headers for POST requests. Adding a valid referer header to the request resolves the issue. The customer needs to configure the referrer filter to allow the referrer host.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729517191.863279",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Bancolombia\",\n    \"component\": \"PDF Preview Service\",\n    \"question\": \"Bancolombia has reported an issue with the PDF Preview Service on the Cloud. They have created a PDF Preview service embedded in an adaptive form, which calls the DOR Service to preview the adaptive form as a PDF. The issue is intermittent and is only occurring in the Dev environment and with specific adaptive forms. Upon re-uploading the PDF, it works fine for a period of time. When the issue occurs, an error is observed. The AEM release version in use is 2024.10.18175.20241010T124406Z.\",\n    \"answer\": \"Please open a"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729212429.515339",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Validation appears on load vs on click of Next. The customer has raised a concern about fields getting pre-validated before clicking the next button for both radio and dropdown fields. The expected behavior should be that the field does not get pre-validated unless the next or submit button is clicked.\",\n    \"answer\": \"This issue occurs due to the ‘clear value’ rule when the text field is cleared after selecting ‘yes’ in the radio button. Clearing the value behaves similarly to a user manually removing data from the UI, and since the field is required, the error message appears. If you"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729202334.599009",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Jackson National Life\",\n    \"component\": \"Configuration browser\",\n    \"question\": \"Unable to create a folder/entry via UI in Configuration browser. Customer is added in Administrator and Developer IMS groups. POST call is failing and error in splunk logs indicates 'com.adobe.granite.auth.ims.impl.IMSApi Toggle router missing'. Requesting feedback on permissions or need for JIRA.\",\n    \"answer\": \"Setting 'com.adobe.granite.toggle.impl.dev.DynamicToggleProviderImpl' to 'FT_GRANITE-52130' might help. It was suggested to update this value and test the scenario. Customer cannot access /system/console/configMgr on cloud, needs to update"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729146428.452769",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms and Signing\",\n    \"question\": \"Problems displaying the Forms from AEMFaaCS, probable rum-standalone.js issue\",\n    \"answer\": \"The issue is due to access being blocked at their CDN level resulting in a 403 Forbidden error. Two options were provided: disable the RUM OT for their instance or enable RUM external route via operational toggle. The OT_com.adobe.granite.webvitals.rum_disable was added for their program, and forms started loading. Additionally, LPL Finance was advised to add the 'aem-forms' prefix to certain paths and route the requests to the AEM server"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729073441.911649",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer reported an issue using the validation on the getcurrentDate function when using isAfter and isBefore. Able to reproduce at our end with latest core component version 3.0.68. Same validation isBefore works with other expression. Could you check looks like issue with the rule generated?\",\n    \"answer\": \"Created ticket for the issue: https://jira.corp.adobe.com/browse/FORMS-16943. This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1729059237.404969",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"AEM Forms core components\",\n    \"question\": \"Enter key is not supported in core dropdown and button components in the 2024 cloud SDK version, affecting keyboard navigation and form submissions.\",\n    \"answer\": \"This behavior is by design to prevent form submissions with the Enter key. The issue has been acknowledged, and a Jira ticket (FORMS-16930) has been raised to address form submission problems. Dropdowns will not work with the Enter key as per HTML5 specifications, but form submission issues will be fixed.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1728893265.165639",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"John Muir Health\",\n    \"component\": \"AEM Form Component\",\n    \"question\": \"Accessibility issue in AEM forms core component: no alternative text for the iframe across both the Cloud Core Component and the On-prem Core Component.\",\n    \"answer\": \"The issue is resolved as part of FORMS-12577. The fix is available in the 2024.4 release version and can be found here: https://github.com/adobe/aem-core-forms-components/blob/master/ui.apps/src/main/content/jcr_root/apps/core/fd/components/aemform/v2/aemform/aemform.html. For on-prem environments, the fix is included in the latest core component version as"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1728840939.816789",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer configured the POST Call on the submission of the Form and wants the PUT Call to be logged instead of the POST due to security reasons. Is this use case possible?\",\n    \"answer\": \"Outbound requests do not go through the dispatcher and it is not possible to achieve this. The Dispatcher is primarily designed for caching and load balancing web content. Calls to backend services or third-party APIs from within AEM code are usually direct and do not pass through the Dispatcher. Therefore, it is not feasible to have the PUT Call logged instead of the POST Call in the Dispatcher logs.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1728628059.444719",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"FirstBank Puerto Rico\",\n    \"component\": \"Adaptive Forms\",\n    \"question\": \"System not publishing in author. Already published forms to clients are not working. Forms are getting stuck after submission, and authors are unable to publish changes in the production environment.\",\n    \"answer\": \"Updating the thread: Customer confirmed, post restart changes made in the content is reflecting fine, though form submission issue still persists. The issue has been documented and monitored under JIRA FORMS-16872.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1728530716.050679",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"Forms\",\n    \"question\": \"Customer needs to re-enable the auto update in STAGE and PROD environments. They want to update only the STAGE environment first, verify it, and then proceed with PROD. They also asked for the time required for the update and any particular days when Adobe can roll out updates.\",\n    \"answer\": \"It is possible to update only the STAGE environment. The Forms team will update the customer’s stage environment and revert on this thread. Customer has confirmed to proceed with the Stage Deployment. The pipeline has been triggered, and the current state is RUNNING. This will update the stage environment and then wait for customer approval for"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1728463470.001659",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"PACIFIC GAS AND ELECTRIC CO\",\n    \"component\": \"Adaptive Forms and Forms\",\n    \"question\": \"Can we leverage AEM Forms based on Core Components in our current Program/Instance? If yes, can you provide any online documentation with procedures/examples/best practices? If yes, can we leverage the new auto-save feature mentioned on the latest release notes? If yes, please provide any available documentation.\",\n    \"answer\": \"1. Yes, you can have both foundation and core components on the same Program/Instance. You need to have forms addon enabled on the program to make use of forms core components.\\n2. Online Documentation: https://experienceleague.adobe.com/en/docs/"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1728327818.946339",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"ContextHub\",\n    \"question\": \"The customer is encountering errors related to ContextHub when refreshing the sites page in the DEV and STAGE environments, but not in PROD. The errors do not appear to impact any functionality, and there are no related entries in the AEM error logs or dispatcher error logs. The customer is requesting an explanation for why these errors are appearing when the page is refreshed.\",\n    \"answer\": \"It seems to be a Sites issue. This Slack channel is for Forms issues. Although AFLAC is an AEM Forms customer, the issue is related to the usage of Sites."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1728301201.337749",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"INAIL\",\n    \"component\": \"Forms\",\n    \"question\": \"Post-submission form URL rewrite - parameters 'aemFormComponentPath' and 'afSuccessRedirectUrl' are not rewritten; this causes the call to fail.\",\n    \"answer\": \"The fix concerning resource resolver mapping is behind a feature toggle (FT), and is addressing only the specific customer use case. A JIRA ticket (FORMS-16800) has been created to gather all customer use cases related to resource resolver mappings.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1728083977.027969",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Navy Federal Credit Union\",\n    \"component\": \"AEMFaaCS Forms\",\n    \"question\": \"The customer is conducting performance testing on the AEMFaaCS Forms environment and encountering intermittent endpoint failures. They are also inquiring about the load capacity of the DEV environment, the possibility of increasing the number of publish pods, and the prerequisites for integrating New Relic. Additionally, they are experiencing issues such as 400 and 503 errors, and high memory and CPU utilization.\",\n    \"answer\": \"DEV environments are not meant for performance testing due to limited resources. Performance testing should be conducted on the stage environment. The dev environment can handle 1000-2000 requests depending on"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1727905581.308809",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Navy Federal Credit Union\",\n    \"component\": \"Forms Publish\",\n    \"question\": \"The customer is experiencing incorrect response codes from their AEM Forms Publish environment. They expect a 433 response code for bad data but are receiving a 500 internal server error.\",\n    \"answer\": \"Customer needs to set the header `x-aem-error-pass: true` in their custom servlet code to pass the actual error to the client. If the issue persists, it may be related to customer code or dispatcher level settings, and further analysis by the AEM FCCS team is recommended.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1727783115.979069",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"Adaptive forms\",\n    \"question\": \"Issue with the unpublishing of adaptive forms where the button status does not revert to 'Publish' even though the form has been unpublished.\",\n    \"answer\": \"Logging a bug and marking the thread as resolved. Request to get the JIRA prioritized and provide updates to the customer. A workaround is available for unpublish, and the team will work on a fix in parallel.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1727463402.199999",
    "source": "slack",
    "messages": "{\n    \"company\": \"SELECTHEALTH, INC. AS AN AFFILIATE OF IHC HEALTH SERVICES, INC.\",\n    \"component\": \"Forms\",\n    \"question\": \"Cannot add Forms on the PROD program. Customer is unable to add Sites or Forms - Communications under 'Solutions and Add-ons' due to missing Enhanced Security credits. After adding credits, they still cannot add Forms - Communications and receive an error message 'An error occurred during updating Program Settings'.\",\n    \"answer\": \"The issue was partially fixed after adding credits on the instance. For the remaining issue, contact the cloud manager team. This was the same issue as CMGR-62565. The thread has been closed, and no further action is required.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1727438113.509269",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"F5 Shape Integration\",\n    \"question\": \"Customer is working on F5 shape cloud integration on AEM Forms publisher custom Domain. They need additional logs from CDN with details like IPs from which request is received, and all the request/response headers. They need to track complete request flow while doing proxy. Additionally, they need to check if requests through Apache rules can flow directly from Apache to the external Host and vice-versa without CDN coming into picture.\",\n    \"answer\": \"Any inputs to capture this information for the customer or any team who can assist on this?\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1727369752.838089",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"The customer wants to confirm if Advanced networking like dedicated egress IP and VPN are allowed for Non-PROD environment? The customer have application behind the Aflac firewall that can only be accessed via a VPN connection or Static IP address. They have requirement to access those services from AEM DEV instance.\",\n    \"answer\": \"Please follow the attached documentation regarding Advanced networking like dedicated egress IP and VPN. [0]: https://experienceleague.adobe.com/en/docs/experience-manager-learn/cloud-service/networking/dedicated-egress-ip-address"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1727223048.596999",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NFL\",\n    \"component\": \"Create Adaptive Form\",\n    \"question\": \"Not able to see the Create Adaptive Form button on all environments. The issue is inconsistent as it occurs on different browsers and sometimes resolves temporarily in incognito mode or with a VPN.\",\n    \"answer\": \"The issue was traced to a faulty pod and an Externalizer API invocation issue. Deleting the faulty pod provided a temporary fix, but the root issue was resolved after updating the externalizer configuration.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1727088026.274819",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Parcel Service\",\n    \"component\": \"Forms\",\n    \"question\": \"Unable to capture Logs for Email Service Configuration. Customer wants to confirm if there is a way to capture this configuration in their AEM Error logs every time a mail is triggered.\",\n    \"answer\": \"Since the configuration may contain sensitive information, it cannot be logged directly by the product. The customer needs to create an enhancement ticket to enable this via debug logs. The relevant config being used during adaptive form email submission would be logged as part of the JIRA.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726879127.319639",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Atco Group\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"One of our Customers Atco group has reached out to us highlighting that their Prod updates are paused.\",\n    \"answer\": \"The issue was due to the regression rollback for SKYOPS-82389. The customer has upgraded their DEV and the issue is fixed. A request for a manual update of their Stage and Prod has been raised under SKYOPS-86648. The customer has been notified via the outreach. Marking this as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726860551.734759",
    "source": "slack",
    "messages": "{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Security Issue - Cross Site Scripting. The issue is when a script like '<img src=f onerror=alert(1)>' in a text box and then tab out the script gets executed.\",\n    \"answer\": \"The issue has been resolved in the newer version. The DOMPurify library was included to address the XSS vulnerability.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726644861.534689",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Repeating Panel\",\n    \"question\": \"The rule-based auto-population of a text field does not work as expected after adding a new panel instance between existing panels.\",\n    \"answer\": \"A workaround using a custom function was shared with Nicole, and a bug has been logged in the visual rule editor. The issue is reproducible, and a custom function has been added to the shared instance to resolve the problem temporarily. The bug has been logged at https://jira.corp.adobe.com/browse/FORMS-16466.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726600189.809959",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"The issue was that when you create a mobile form and access it on an iPhone using Safari browser, scrolling up causes data loss.\",\n    \"answer\": \"An auto-save option can be configured on an Adaptive Form to save automatically based on a time-based event, ensuring the form is saved after the specified duration. When Forms Portal components are enabled for the environment, the Auto Save tab appears in the Forms container properties.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726566296.569539",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NFL\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"Error while creating new Adaptive Form. The customer is seeing an issue on their newly enabled AEM Forms. When we try to create a new Adaptive Form, it runs into an error as shown in the attached screenshot. When reviewed the URL, it shows the custom publish domain as the repo while it should be a different URL. This issue is happening on all the environments (Dev, Stage & Prod).\",\n    \"answer\": \"Made updates to the externalizer and fixed an issue with the author externalizer config.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726530174.594649",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Sharepoint Submission\",\n    \"question\": \"When attempting to use the Sharepoint submission option, they are getting errors going over 100 MB even if the limit is set to 300MB. Is there a default limit to what can be submitted to Sharepoint? When the customer submits over 100 MB, it throws a 500 error.\",\n    \"answer\": \"The DoR pod was restarting due to an OOM Killed error. It was suggested to test in a higher environment (either stage/prod) or increase the memory of the dev environment for testing. After increasing the memory for the dev environment, the customer was able to"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726505712.122389",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Adobe\",\n    \"component\": \"Drafts & Submissions\",\n    \"question\": \"Submitted Form is editable, loses all the submitted data when opened from the Draft and Submission Portal.\",\n    \"answer\": \"Due to security reasons, submitted forms which are listed should not be clickable. You can view the submitted forms in the list but won't be able to edit them. A JIRA has been logged to disable the click on submitted forms. JIRA details: https://jira.corp.adobe.com/browse/FORMS-16449. ETA will be provided tomorrow.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726156557.419029",
    "source": "slack",
    "messages": "{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"The customer is trying to enable Adobe Client Data Layer (ACDL) for forms, specifically for analytics integration. They want to confirm the customization options for ACDL in forms compared to the flexibility available for WCM components, emphasizing the need for additional properties. They also sought documentation or guidance on achieving this.\",\n    \"answer\": \"We have to add the sling:configRef for all the forms as well to enable ACDL. Added sling:configRef for each form and it is working fine. You can update all forms at once by utilizing inheritance in Sling Context-Aware Configuration. For more details,"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726145267.680799",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Adobe\",\n    \"component\": \"DoR\",\n    \"question\": \"Unable to generate document of record when submitting to Azure blob. Trying to generate a document of record to be rendered to the user upon submission and be stored in Azure Blob. This does not seem to be working. Data do not know where the DOR is stored.\",\n    \"answer\": \"We validated the query locally and after submitting the form, the related DoR is created and saved in Azure. You can identify where the DoR is stored under the Location tab '<container_name>/<form_name>/<year>/<Month>/<Date>/<Relevant folder>'.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726084233.026059",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMFORMS-AEMaaCS\",\n    \"question\": \"When a new panel is added, the field for the incident ID does not populate with a value. However, when subsequent panels are added, the incident ID appears correctly in the field for all other panels.\",\n    \"answer\": \"The issue is being addressed. A fix is available in the core-forms-components-reactor-3.0.58 release. An alternative solution using a custom function is provided, but the customer still faces issues. The updated code will be shared, and a demo session will be arranged. The issue is marked as resolved in the thread.\"\n}\n"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726077850.098829",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Investors Group\",\n    \"component\": \"AEM Forms integration with Adobe Launch & Analytics\",\n    \"question\": \"The custom event set up in Launch that should fire on form submit is not firing. The rule isn't triggering, affecting their campaign.\",\n    \"answer\": \"Ensure that the customer has published the library after adding the rule. If the issue persists, the AEM support team needs to investigate if the 'Event Type: Submit' is not firing, the launch JavaScript is not running, or there's a configuration issue on the AEM side. The customer should add the support team user to the Cloud instance for further investigation. A Jira ticket (FORMS-16478) has been created"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726057256.829449",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"Previewing Content Service\",\n    \"question\": \"UHG highlighted the concern while using the Previewing Content service. As per the documentation, the functionality is for the AEM Sites. However, they are using it for the AEM Forms. While using this they are experiencing a 404 response. Kindly help me confirm if the similar steps can be followed for the AEM Forms on Cloud. Is preview tier supported for forms?\",\n    \"answer\": \"This is not supported yet. We are working on this to provide support within Forms Manager. There is an FPR logged for the same: https://jira.corp.adobe.com/browse/FORMS"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726043848.818169",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AAA WASHINGTON\",\n    \"component\": \"Forms Manager\",\n    \"question\": \"Deploy to Stage takes more minutes than normal.\",\n    \"answer\": \"This deployment issue is not caused by FM. NPE issue was already fixed and will be part of the next sites/rotary release.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726012073.833009",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS AEMForms\",\n    \"question\": \"The customer highlighted the issue with the Repeatable Panel add functionality. When the panel is added it updates the name as expected but whenever a new panel is added between the existing panels, the count again starts from the beginning.\",\n    \"answer\": \"I have fixed the code in the provided instance and the use-case is working fine. I have logged a bug as requested for this use case. The panel label not being updated during initialize has been fixed via <https://github.com/adobe/aem-core-forms-components/pull/1395>. You can wait for the next release"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1726012015.635569",
    "source": "slack",
    "messages": "{\n    \"company\": \"AEMFaaCS\",\n    \"component\": \"N/A\",\n    \"question\": \"This message was deleted.\",\n    \"answer\": \"N/A\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725958549.572189",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS AEMForms- FDM\",\n    \"question\": \"The customer has a database which CRM Dynamics connect as their FDM. The issue is that while the queries can be obtained clicking 'Test Service' when arguments are simple fields, when the argument is a related entity, the input is empty for the repeated panel when using a GET query on an entity with field to be used for invoke service. In this form on the submit action item, we provide the input and using the GET call using the invoke and it does not bring the data.\",\n    \"answer\": \"Currently, repeatable panels are not supported for invoke service"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725948406.147629",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"MAURICE BLACKBURN PTY LIMITED\",\n    \"component\": \"Text Box form component\",\n    \"question\": \"Short description help content is duplicated on hover, displaying both under the field and within a tooltip.\",\n    \"answer\": \"It is a feature; the tooltip cannot be disabled.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725633813.548709",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"Form Fragments\",\n    \"question\": \"Form Fragment rules not executing on the actual form. The issue started occurring since the latest release, and the customer mentioned it was working fine till the June release.\",\n    \"answer\": \"This is happening because the reference to the fields in the rules is absolute and changes when it is included onto the form. A fix has been uploaded to the shared instance, and the use case is now functioning correctly. The official release will be updated, and the issue is tracked in JIRA: https://jira.corp.adobe.com/browse/FORMS-16296. The fixed version can be found at https://github"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725390230.304649",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Wiley\",\n    \"component\": \"Adaptive Form Container\",\n    \"question\": \"AEM Adaptive Form Container Component's submission is not working on AEM pages. The customer is choosing 'Submit to REST Endpoint' and getting a 500 internal server error.\",\n    \"answer\": \"The issue was validated and found to be due to the endpoint service being inaccessible, possibly due to issues with the URL or the service itself. Recommended the customer to verify if the endpoint is accessible via Postman or directly, and consider IP whitelisting as a potential cause for the inaccessibility. Additionally, suggested creating a custom submit action based on configuration needs as an alternative solution.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725389465.681649",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Repeatable Panel Add & Delete Custom Function\",\n    \"question\": \"The customer highlighted the issue with the Repeatable Panel Add & Delete Custom Function. Specifically, adding a new panel after the 1st instance adds the instance after the last panel, and the delete button deletes the panel from the end no matter which panel is selected.\",\n    \"answer\": \"The function was fixed in the instance shared, and the use-case is now working fine. The code was also shared for reference. Additionally, a JIRA ticket has been logged to improve the visual rule editor to take the instance index.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725368107.814969",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Walmart Stores\",\n    \"component\": \"BPA Report\",\n    \"question\": \"The customer reports that after running a BPA (Best Practice Assessment) report for their AEM (Adobe Experience Manager) platform in preparation for a migration to AEM Cloud, they found approximately 550 assets missing their original renditions. These assets flagged are all forms located under content/dam/formsanddocuments. The customer inquires about the necessity of resolving this issue before migration, attempts to reupload the forms did not solve the problem, and they seek clarification on the potential impact of migrating these forms as it is.\",\n    \"answer\": \"I have checked that it is the default behavior for the adaptive forms, that"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725299771.152079",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Qualcomm\",\n    \"component\": \"Forms\",\n    \"question\": \"Error while submitting the form in the Publisher. The customer has the Submit to rest endpoint on submit action and its working fine using Postman but getting an error while calling the POST request while submitting the form in the publisher. This particular form is calling another servlet and getting the 403 error code.\",\n    \"answer\": \"The issue was with IP whitelisting that was preventing forms from being submitted. The problem was resolved by whitelisting Adobe's public IP addresses for the test environment. The Rest Endpoint URL was not accessible from outside the organization, causing the 403 errors. After identifying IP whitelisting as the culprit,"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725249851.260009",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"Forms Component - Drop-down List\",\n    \"question\": \"Drop-down List is breaking for 'Allow Multiple Selection' checkbox in V2 Forms.\",\n    \"answer\": \"You have added the list in default options, you need to add it in the options. For use-cases like this, you could also consult the core component test collateral and the relevant component collateral. Refer to `content/forms/af/core-components-it/samples/dropdown/basic.html` for examples and details. This thread has been closed and marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725224511.039859",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer highlighted the issue with the Data not getting reset from the fields on refreshing the form in the Firefox browser. The form is working as expected in the Chrome browser.\",\n    \"answer\": \"Firefox often retains form data across page reloads if it has been filled out previously. This is because Firefox tends to store the input values in its cache. Since this is browser specific behavior, you can use attributes like `autocomplete=\\\"off\\\"` to disable this behavior in Firefox. However, `autocomplete` attribute itself does not directly apply to some form elements like checkboxes and radio buttons. In foundation forms, the"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725212520.935969",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Navy Federal Credit Union\",\n    \"component\": \"Correspondence Letters in AEMFaaCS\",\n    \"question\": \"One of our customers highlighted a requirement to generate member letters via AEM forms output service implementation. The basic use case is to create a member-specific letter unique to itself and proceed further with the communication. They are considering whether to utilize AEM’s Correspondence Management features for this purpose. According to the documentation, correspondence letter creation is available in AEM 6.5 but not in AEM Forms as a Cloud Service. Could you provide guidance on how the customer’s development team might quickly evaluate the feasibility of using AEM Forms as a Cloud Service for their correspondence needs?"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725022948.680059",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SelectHealth, Inc. as an affiliate of IHC Health Services, Inc.\",\n    \"component\": \"Forms, Sites, Assets\",\n    \"question\": \"Cannot select forms or sites for our environments due to enhanced security. Customer needs Sites, Assets and Forms on their Production program.\",\n    \"answer\": \"Customer needs to buy an equal number of enhanced security SKUs for each solution (Sites, Assets, Forms) they want to add to the same program. Alternatively, they can create a different program where enhanced security is not enabled. The customer should reach out to their sales rep or account team for further assistance. The issue has been confirmed as working as designed and the sales team has been informed.\"\n"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1725022843.484259",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"RDE\",\n    \"question\": \"AFLAC raised the request to rollback the RDE to the lower version. Can the RDE Server be downgraded to the lower version?\",\n    \"answer\": \"The documentation clearly indicates that RDE environments cannot be set to a particular AEM release. When you reset a RDE environment, it always comes up with the latest release. Therefore, the request to rollback the RDE to a lower version cannot be fulfilled.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724861435.909079",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Four Point Solutions\",\n    \"component\": \"Adaptive Forms\",\n    \"question\": \"Submission of Adaptive form data to OneDrive folder on AEMaaCS failing and connection to OneDrive keeps disconnecting.\",\n    \"answer\": \"Customer needs to upgrade the core components version to the newer version. The issue is assumed to be resolved as there has been no response from the customer for months.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724839226.598949",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NFL\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Customer tried the steps but the update option is greyed out.\",\n    \"answer\": \"There should be a tooltip when they hover over the button. Just by looking at the picture it seems the go-live date is probably in the past, and assume that's why the button is disabled. If the go-live date is in the past you can't update the program to use that date. You can also mark the go-live as complete and then it shouldn't matter for updating the program. Usually whenever we disable a button we have a tooltip as well that explains why it's disabled. On the update button when disabled we do not see any tooltip"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724835134.864319",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"Forms\",\n    \"question\": \"The Copy-Paste option in Forms and document to copy the Forms is not working in the Stage and DEV environment. Currently, Stage and DEV are on the 2024.7 version and the production that is working is on a lower version.\",\n    \"answer\": \"The issue has been logged in Jira (FORMS-16183) and the thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724804032.050379",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Error on all servers. Received a status code 404 when contacting the token endpoint. Error performing the token exchange HTTP request.\",\n    \"answer\": \"This is a harmless log (contributing to noise) that is being fixed by the security team. It will be fixed in future releases.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724788206.763299",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adaptive Forms\",\n    \"question\": \"Issue with the Translation - Unintended Project Creation and Manual Configuration Updates\",\n    \"answer\": \"For unintended project creation, a ticket was logged and steps to reproduce the issue were provided. The issue is not observed for Sites/Pages. For manual configuration updates, the customer needs to use add-dictionary and then create the project. The issue is related to Forms only and not Sites.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724781284.623429",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Forms/Submission IDs\",\n    \"question\": \"Submission IDs are not visible in the logs for the forms submissions over the cloud. The customer is submitting the data to the FDM and the submission IDs are not visible.\",\n    \"answer\": \"Submission IDs are not expected to be visible in any transaction logs as this is the default behavior. State of Pennsylvania has custom submit action, they will receive this information there, and if they wish to log that, they can do so. CRUD connector does return the submission ID to the caller of the API. The customer has been notified that this is the default behavior.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724418691.224249",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMForms AEMaaCS\",\n    \"question\": \"The customer is creating a custom error handler and wants to know if it is possible to pass arguments to the custom error handler, such as a panel or fields to hide/show on the page or disable certain fields.\",\n    \"answer\": \"Yes, fields as parameters can be passed to a custom function. This can be achieved using globals, which allows access to the form and form fields to apply different rules. A code example is provided to demonstrate this functionality. As of now, using globals is the only method available, but a feature to achieve this use case more effectively will be available"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724387796.862689",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"Forms\",\n    \"question\": \"Suncorp has raised a concern that their Stage environment is running an old version of forms addon which is causing issues. They want to update to the latest forms addon version that fixed the issue in their QA environment.\",\n    \"answer\": \"The Stage environment will be auto-updated to the latest release 17465 via RO/RV. If an immediate upgrade is needed, a SKYOPS ticket should be created for the Release Orchestrator team.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724117840.566759",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"PACIFIC GAS AND ELECTRIC CO\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"None of the AEM Forms embedded in SITES pages are loading after update 2024.8.17465\",\n    \"answer\": \"The issue was investigated and found to be related to AEM Forms Container Component in Sites. Network call 'aemform.iframe.en.html' was not responding correctly. After debugging, it was identified that the URL called internally using the iframe on publish was not resolving correctly, while it worked fine in Author mode. The issue was tracked and resolved through JIRA RFH FORMS-16157.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1724077886.759009",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Qualcomm Experience Cloud\",\n    \"component\": \"AEM Forms integration with React SPA\",\n    \"question\": \"The customer is having some issue with integrating AEM Forms with React SPA. The documentation followed is outdated, and the React code available in the provided GitHub repo is very old and uses deprecated libraries. The customer wanted to check if they need to modify this React code or if there is any other approach/code available. Additionally, the customer is facing issues with headless forms and SPA integration, and they have several questions about documentation and support for cloud services.\",\n    \"answer\": \"Currently, the SPA editor support for authoring forms is in progress and will be available soon. In the meantime"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723697319.899929",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Email components\",\n    \"question\": \"Email components failing when core components based forms has Email Template. Error during form submission: FORM_SUBMISSION, errorMessage: 'Could not create email', originCode: '500'.\",\n    \"answer\": \"Fix is available in AEM SDK 17465. The issue is resolved in Adobe Experience Manager 2024.8.17465.20240813T175259Z-240700 and Adobe Experience Manager Forms 2024.07.31.00-240700.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723695133.212879",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Health Group\",\n    \"component\": \"Checkbox Group\",\n    \"question\": \"Checkbox Group component not working as expected. Only one of the multiple selected fields is being reflected in the DOR being generated.\",\n    \"answer\": \"This issue is already fixed and will be available in the next AEM Forms SDK release. It was not included in the August release but will be part of the next sites rotary release.\"\n},\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Checkbox Group\",\n    \"question\": \"CRM integration with AF expects the data from checkbox group in the format of comma-separated string, but after the fix, since the data is being sent as"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723597320.895039",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Core Components\",\n    \"question\": \"Unable to submit AF bases on core component when embedded on a webpage. The submit button is greyed out.\",\n    \"answer\": \"Including the client library resolved the issue. The client library is necessary for core component-based forms to enhance performance. This is not required for foundation component-based forms.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723489044.559239",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NAVY FEDERAL CREDIT UNION\",\n    \"component\": \"AEC Forms\",\n    \"question\": \"Intermittent 409 Errors When Invoking Servlet URL in AEC Forms. The customer is generating an IMS token via a specific URL and successfully obtains the token. Then, using the obtained token, they set it as a bearer token to invoke the servlet URL automatically through the Mulesoft application programmatically. Intermittently, the customer encounters 409 errors on the Publish server. The issue is observed to be related to CUG permissions and token validation.\",\n    \"answer\": \"A suggestion was made to create a customer JIRA and assign it to the security team for investigation. The issue was identified"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723462056.637779",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adobe Experience Manager Forms\",\n    \"question\": \"The customer has configured a custom message for a field using the provided documentation. The function appears to work as expected, but the form is still being submitted despite the warning. Is this the intended behavior? Shouldn't the form submission be blocked when the warning is active?\",\n    \"answer\": \"This is a bug, and it has been logged for fixing. Ideally, the customer should use the inbuilt minLength validation of the component to avoid this issue. The current bug is fixed in the latest release. The custom function provided in the documentation should mark the field as valid if it was previously marked"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723444378.282939",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Group Checkbox Core Component on Cloud\",\n    \"question\": \"Group Checkbox Core Component on Cloud saving only one value.\",\n    \"answer\": \"The current release version 2024.07.17.02 does not include the fix, which is present in 2024.07.17.06. A private release may be needed, but if it is not blocking their go-live, it is recommended to wait for the next public release on August 29, 2024 (version 2024.8.0). This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723210595.126519",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"When the customer tries to POST a date value, the output is converted to T00 format. Upon submission and checking the network logs, the correct date format is seen. However, when a get call is made to the test service on FDM, the response received is again converted into T04 format. The customer wants to understand why there are multiple conversions in the date format, how these conversions are handled, which services and submissions cause these conversions, or if it is due to AEM Forms. They also want to know if the conversion occurs on submission or when storing data to the database.\",\n    \""
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723209538.638529",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Custom Submit On AEM Forms as a Cloud service\",\n    \"question\": \"Customer tried to make changes to the POST.POST.jsp in the sample, which is not working. They want to add email functionality along with the FDM submit.\",\n    \"answer\": \"We do not support `post.POST.jsp` in core component-based forms because JSP code is outdated and challenging to debug. Instead, you should implement the business logic directly in Java code. Examples of this approach can be found here: https://github.com/adobe/aem-core-forms-components/tree/master/it/apps/src/main/content/jcr_root/apps/forms-core-components-it/customsubmission"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723100301.742859",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"How to restrict the upload of files with double extensions to prevent the form from being submitted under these conditions?\",\n    \"answer\": \"Bug logged for the issue with reference ticket FORMS-15786.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1723047834.624789",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"KOHLER CO\",\n    \"component\": \"Forms\",\n    \"question\": \"Hidden form fields' values are not being sent when submitting the form. The customer has written a method in the clientlib to assign default values to all hidden fields before submission, but the values are not getting picked up.\",\n    \"answer\": \"The customer was manipulating the view directly using the DOM APIs, which did not affect the submission as the model data remained outdated. They were advised to use the GuideBridge model APIs to update values. Additionally, it was pointed out that only data from adaptive form fields are sent to the server. The customer updated their code accordingly and the issue was resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1722968091.927489",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"JOHN MUIR HEALTH\",\n    \"component\": \"hCaptcha in AEM 6.5\",\n    \"question\": \"Can hCaptcha be used on-premise if core components are deployed to the environment?\",\n    \"answer\": \"hCaptcha is not available on AEM 6.5 as of now. The Early adopter program is only for AEM Forms as a cloud service and is not available on 6.5. The customer can plan migration to cloud service to make use of the latest early adopter features. There is no technical challenge in implementing this for 6.5 but we are re-evaluating the features that need to be back-ported to 6.5"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1722929102.750779",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"Forms\",\n    \"question\": \"Intermittent issue while opening Forms Tab from AEM home page post Forms 2024.07.05.00-240700. Service outage error in Author on click of Forms Tab.\",\n    \"answer\": \"The issue appears to be related to a custom index not being utilized when running queries. This is causing slow query performance. The indexing team will investigate the custom index issue to resolve the problem and improve performance. A JIRA has been logged with the indexing team: https://jira.corp.adobe.com/browse/GRANITE-53502\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1722528045.188409",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"Workflow API\",\n    \"question\": \"Unable to get active workitem after latest release: DEV - 2024.6.16799.20240614T073455Z. WorkflowSession is null when using granite packages. Works correctly with day.cq packages.\",\n    \"answer\": \"The issue could not be replicated at our end. When using com.adobe.granite.workflow.WorkflowException, a scheduler service should be created with a service user, which was not replicable. A Jira (FORMS-15886) has been logged to further investigate the issue.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1722382005.327059",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Repeatable Panels\",\n    \"question\": \"How to dynamically set repeated panels label when the add button is clicked. The current method used to set the label property does not work.\",\n    \"answer\": \"The `label` is considered an object, which is why it didn’t work. Use `globals.functions.setProperty(repeatedPanel[1].labelPanel,{label : {\\\"value\\\" : \\\"hello\\\"}})` instead. More details on the shape of each property can be found in the provided documentation. If updating via rule editor, ensure 'globals' field is correctly set. If issues persist, upgrade the core component version to the"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1722271832.602629",
    "source": "slack",
    "messages": "{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS AEMForms\",\n    \"question\": \"Unable to bind DOR to dynamics FDM. The customer is trying to POST to an entity with DOR as an attachment bound to an entity field, but DOR is not being sent as PDF on submit.\",\n    \"answer\": \"The issue has been identified as related to core components based form submission. The ticket FORMS-15682 has been logged for this issue, and it has been marked resolved.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721938685.875939",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"DTE ENERGY CORPORATE SERVICES LLC\",\n    \"component\": \"Regex for US number\",\n    \"question\": \"Please help with regex details of US phone number. There is no maximum numbers field, users can enter more than 10 digits. Users can enter telephone numbers in incorrect formats.\",\n    \"answer\": \"Use the validation pattern ^(\\\\([0-9]{3}\\\\) |[0-9]{3}-)[0-9]{3}-[0-9]{4}$ to restrict input to 10 digits and format it correctly. For further constraints and specific display formats, use custom clientlibs and apply rules. The issue regarding the maximum numbers field was fixed recently via https://"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721783127.931459",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Forms\",\n    \"question\": \"Unable to load schema on forms when FDM has more entities. Specifically, when adding the association 'bopcms_Application' between entities 'incident' and 'bopcms_erqemployment', the Adaptive Form does not show the schema under edit mode.\",\n    \"answer\": \"The issue was identified to be related to form rendering when the association was called, causing the render condition to go invalid despite values being fetched correctly in the FDM response payload. A RFH was logged for the same: https://jira.corp.adobe.com/browse/FORMS-15614. The issue was related"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721729890.911569",
    "source": "slack",
    "messages": "{\n    \"company\": \"DTE ENERGY CORPORATE SERVICES LLC\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"The customer wants to know if there is a way to remove the header option in AEM Forms Adaptive Form when viewing in mobile view or any smaller view.\",\n    \"answer\": \"A mere CSS change in their theme will be able to hide this from the UI. One can use theme-editor to add this change to the theme too, in case they are using a theme created via theme editor.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721312624.474299",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"DTE ENERGY CORPORATE SERVICES LLC\",\n    \"component\": \"Adaptive Form in AEM Forms as a Cloud Service\",\n    \"question\": \"The customer is using foundational components and in adaptive Forms there is numeric field which has a property for the maximum number of digits. They need the same for the minimum number of digits which is not currently available. The option of Custom Clientlibs is not working with foundational components.\",\n    \"answer\": \"Custom functions should work in foundation-component form. The issue was due to the 'functions.js' file not being ES5 compatible. After removing 'functions.js' from the clientlib, it is working now. Customers are suggested to migrate to Core-component based forms for"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721224514.419009",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMForms\",\n    \"question\": \"The customer has an FDM and connected to their CRM. They would like to populate the form like the native form (using core components) with data from CRM, including repeated panels or array of values within CRM. However, when trying to prefill the form with a set of arrays, the form does not load and only shows a spinner in the browser.\",\n    \"answer\": \"Suggested using JSON Schema to define the structure of the form and the data it consumes. Also, recommended checking the setup for outdated versions of core components and trying with the latest versions. Logged two Jira tickets for the issues"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721220320.426509",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS AEMForms - FDM\",\n    \"question\": \"The customer have a custom CRM Dynamics connector and an FDM. The issue is that while the queries can be obtained clicking 'Test Service' when arguments are simple fields. When the argument is a related entity, the input is empty. How does Adobe recommend writing a GET query on an entity with field to be used for invoke service?\",\n    \"answer\": \"Adding arguments in operation via edit properties of an entity does not allow to set property of another referenced entity. You can perform the relevant GET operation on the entity itself which has that property in which the API request"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721107191.464289",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMForms\",\n    \"question\": \"Check boxes and radio buttons are not focusable in Safari. When tabbing through AEM forms in Safari, the checkbox and radio buttons for the components are not focusable.\",\n    \"answer\": \"To enable tab navigation for all controls in Safari, users need to adjust their browser settings: Open Safari. Go to 'Preferences' (⌘ + ,). Navigate to the 'Advanced' tab. At the bottom, check the option 'Press Tab to highlight each item on a webpage'.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721074502.755839",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS AEMForms\",\n    \"question\": \"Validation message does not appear when character limits are exceeded for a textbox having multiple lines.\",\n    \"answer\": \"The validation message under 'Maximum characters error message' does not appear because the HTML5 text input prevents typing beyond the specified maxLength. For headless use-cases, the message is used differently. You could implement a custom widget that permits typing more characters, or remove the `maxLength` attribute to check the behavior of the max length error message.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1721066497.808709",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Not specified\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Issue Reason\",\n    \"answer\": \"Reference Ticket# E-001293476\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1720767556.559129",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS Forms\",\n    \"question\": \"Challenges with nested panels persisting data into CRM and the issue with unbound fields in bound repeatable panels.\",\n    \"answer\": \"In core components, there is no concept of bound and unbound fields as every field has a dataRef. In foundation components, unbound fields should not be placed inside bound and repeatable panels as only one instance of the unbound field's data would be submitted for all repeated instances. The customer's use case of syncing unbound fields inside a bound repeatable panel should work if they follow this guideline.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1720696697.247169",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Adobe\",\n    \"component\": \"Forms\",\n    \"question\": \"Need urgent help to raise Rollback Request on Cloud Service. Core Component based Forms, Email Submission Type is failing.\",\n    \"answer\": \"Need to Rollback to previous Release id 16799. Affected customers include Atco Group, United Healthcare, Signal Iduna, Suncorp Insurance Stack, Transurban Production, SUNCORP METWAY LTD Program, and Suncorp - NZ Stack.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1720580748.451569",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"Core components\",\n    \"question\": \"Hidden form fields with default values getting sent across while submitting form. Is this the default behavior on the core components and is there a workaround to control this or is it a bug?\",\n    \"answer\": \"For core components, you can enable the 'Mark as unbound form element' option in the field’s edit dialog to restrict hidden fields' default values being sent. For foundation components, this cannot be done, and a custom solution would be necessary. For specific scenarios, use a custom function to set the dataRef property to null as this use case is not currently supported by the visual rule editor."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1720165003.055439",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Parcel Service\",\n    \"component\": \"Forms\",\n    \"question\": \"Customer encountering an error related to the out-of-the-box client libraries during form submission. Error: GET <https://dev.brand.ups.com/etc.clientlibs/toggles.json> 404 (Not Found). The issue is likely due to the CDN blocking these URLs. You need to whitelist this path in the CDN configuration.\",\n    \"answer\": \"The issue was resolved by modifying the dispatcher configuration. The customer was instructed to add the filter rule `/0254 { /type \\\"allow\\\" /url \\\"/etc.clientlibs/toggles.json\\\" }` to their dispatcher configuration and place it at the correct order (rule"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1720059014.733079",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Western Sydney University\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"AEM Forms hasn't been provisioned. The licensing dashboard shows no entitlement for AEM Forms, but according to the contract, they are paying for AEM Forms.\",\n    \"answer\": \"The customer has purchased AEM Forms Submissions license, which is available to be configured and added to the program. AEM Forms Communication has not been bought and hence, cannot be added. Explain the situation to the customer and ask them to add Forms Digital Enrolment to their program to use the Forms functionality.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1720029242.093249",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Adaptive Core Components Forms\",\n    \"question\": \"The customer has reached out to us stating that after updating Adaptive Core Components Forms the GuideBridge event for form submission doesn't seem to work anymore. They are looking for best practice when attempting to submit a form and update the form values programmatically.\",\n    \"answer\": \"You can use the following code: `guideBridge.getFormModel().dispatch({type: 'submit'});`. For more details on the submit event, please visit: <https://opensource.adobe.com/aem-forms-af-runtime/js-docs/classes/Submit.html|Submit Event Documentation>. To handle submit success and submit error"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1720019177.507079",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS - Core forms - Date field with time\",\n    \"question\": \"Customer is using a Date Picker component and has a custom format set as MM/dd/yyyy hh:mm:ss. When previewing the form, customer sees that time defaults to 12:00:00 even if we try to input it manually. When submitting the form, in the payload we see only the date being sent. Customer wants to know if there is any functionality to be able to select 'time' and also be able to send it via payload.\",\n    \"answer\": \"We don't support time with date type of field. Customers can use a text"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1719819653.227639",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Group Checkbox Core Component on Cloud\",\n    \"question\": \"On submitting the Form, the value of all the checkboxes is not saved.\",\n    \"answer\": \"Seems like a bug in email submission, while the data is being sent correctly, while replacing the data in email template seems like an issue. Kindly open a bug for this. Issue has been logged for further investigation.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1719591419.366019",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Unable to get active workitem after latest release : DEV - 2024.6.16799.20240614T073455Z. The code `workflowSession.getActiveWorkItems(0, -1);` fails in the DEV environment after the update, but works in other environments (STG/PROD).\",\n    \"answer\": \"There were some improvements made with respect to reading the JCR nodes of the workflow/workitem as well as performance improvements for super user checks. Log a JIRA ticket for engineering to investigate."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1719591167.167349",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEM Forms as a Cloud service\",\n    \"question\": \"a) The limitation was inability to invoke another request based on the response of the prior even with handler. Any ability there or suggestions? b) Another issue was the email functionality where email was sent over (email configured for the form) while the actual PUT requests failed.\",\n    \"answer\": \"We are planning to enhance the Rule Editor to allow writing statements on success and failure, including chaining capabilities. In the meantime, you can use custom functions to achieve similar results. Form can only be configured to have one submit action that is, either it would be FDM submit or email"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1719332096.551509",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS AEM FORMS\",\n    \"question\": \"Customer is trying to populate DropDown list dynamically and has raised queries on how it can be achieved. They want to dynamically populate the dropdown when form is previewed. Previously, it worked using 'Set Options Of' event of the DropDown which is not available now.\",\n    \"answer\": \"Customer can use 'setEnum' and 'setEnumNames' to dynamically populate the dropdown. There was a known bug with these properties not working on form/field initialization which has been fixed. They should try with the latest core components. Service Output is not supported in the Visual"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1719254884.656719",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NAVY FEDERAL CREDIT UNION\",\n    \"component\": \"Forms\",\n    \"question\": \"Forms Communications API returning HTTP 500 response for all environments after upgrade to 2024.5.16544.20240530T165853Z.\",\n    \"answer\": \"Release 16544 has a release blocker which has broken Communication APIs. The later release 16799 contains the fix. Please ask the customer to update to release 16799 from CM UI for all their environments and run the corresponding pipelines. This should solve their issue. Also, log a FORMS IW Jira ticket with these details for tracking.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1719236855.394639",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"DTE ENERGY CORPORATE SERVICES LLC\",\n    \"component\": \"Adoptive Forms\",\n    \"question\": \"The customer reached out to us with a query/ask if we can change the class name of a field and each component that you put in the form should have a unique class.\",\n    \"answer\": \"If you modify the CSS class for each instance of a component, the theme that controls the look and feel based on the CSS class will become more complex. Instead, to uniquely identify each component instance, we include the component name in the HTML structure which you could leverage for your use-case. If you still need to add a CSS class specific to a component instance, you could make use"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1719222650.337249",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"FIRSTBANK PUERTO RICO\",\n    \"component\": \"Custom Client Libs\",\n    \"question\": \"The customer is trying to build the custom Client Libraries and facing the issues and error.\",\n    \"answer\": \"Customer is following Core-component based form documentation but creating foundation-component form. For foundation-component form, custom functions only support ES5 features so 'let', 'const', arrow function etc will not work, which is causing the error. Suggested the customer to use Core components to achieve the functionality.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718866243.623869",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"API integration through AEM forms\",\n    \"question\": \"Customer is facing frequent 'read timeout error' when they try to submit form data to Third party API. Their API team has confirmed that during timeout they don't receive the requests. They are using the same code as the core form handler and have a retry mechanism in place, but read timeout increases total time.\",\n    \"answer\": \"The first byte timeout has already been increased. The recommendation is to increase the read timeout value for the HTTP connection. Additionally, for the custom submit action, ensure proper management of connection lifetime by setting appropriate TTL values to avoid re-using idle connections beyond their"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718720717.650599",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Re-captcha Integration\",\n    \"question\": \"Issue with Re-captcha configurations. The customer has configured the Re-Captcha Configurations using the Environment Variables from the Cloud Manager, but all other configurations apart from the Re-captcha are working fine.\",\n    \"answer\": \"Please ask the customer to use the cloud services UI to create the Recaptcha configuration in each of the environments. This will be a one-time activity for the customer. A JIRA has been created to implement this functionality. The customer is proceeding with creating the config in each of the environments from the UI as a workaround.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718675773.472309",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Customer is integrating CRM with AEMFaaCS, currently they have created FDMs for sending data to their endpoints. While sending a PUT request, CRM does not send the child elements of the JSON (limitation at Microsoft side). Customer wants to send multiple PUT requests before submitting the form for each of the child elements. They have questions about workarounds and if workflows can be used to send data/error messages back to publish from author and any impacts in running workflows with multiple PUTs.\",\n    \"answer\": \"You could make use of AEM workflow to submit to multiple entities"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718670540.097779",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Rule Editor\",\n    \"question\": \"Unable to load rule editor when 'Invoke Service' is used. The UI gets in buffering state with error related to javax.jws.WebParam not found.\",\n    \"answer\": \"As a temporary solution, the forms team will be disabling the loader in rule editor. A permanent solution will be placed in the next Foundation Release. Temporary fix will be available in the next release with ETA on 10th July.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718648746.920699",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EPCOR UTILITIES INC\",\n    \"component\": \"AEM forms sharepoint connector\",\n    \"question\": \"AEM forms sharepoint connector fails to add attachments to inserted rows once list is over 999 items long. The form submission fails when the sharepoint list has more than 999 entries and includes an attachment.\",\n    \"answer\": \"The issue is caused by the incorrect formatting in the Sharepoint API request. The attachment request uses 'Items(1,408)' instead of 'Items(1408)', which is not valid according to Sharepoint API documentation. The issue is being investigated and a Jira ticket has been created for further tracking: https://jira.corp.adobe.com/b"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718392460.580329",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Royal College of Physicians and Surgeons of Canada\",\n    \"component\": \"generatePDFOutput API\",\n    \"question\": \"Occasional 503 and Read timed out error with generatePDFOutput API. STG stopped working after updating to 2024.5.16544. DEV wasn't working because it was already on 2024.5.16544. Both DEV and STG have the same error now.\",\n    \"answer\": \"Exception points error at OutputService code layer, not in XMLform layer. Team needs to have a look. The associated ticket has been updated with the appropriate summary for the cause and fix.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718285855.239429",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"AEM DEV\",\n    \"question\": \"Looking for a viable option to access APIs available within Aflac network via advance networking for AEM DEV. Aflac DEV API cannot be exposed to access from AFLAC firewall unlike STG and PROD. Objective is to setup and integration from AEM DEV to AFLAC DEV environments like STG and PROD.\",\n    \"answer\": \"Advanced networking is only supported for stage and prod environments in a production program. Please log a SKYOPS to confirm this as this is independent of forms. This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718225222.260069",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Novo Nordisk\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer has reached out to us stating an issue with the themes publication in the PREVIEW instance. They are using the 'Manage Publication' tool to publish their site's page on the 'Preview' instance to test their forms, but the theme applied to the form is not getting applied and it shows the content without theme or CSS. The same works fine if directly published to the PUBLISH instance. The issue is replicable on their DEV and PROD instances.\",\n    \"answer\": \"Preview service use case is not supported for forms. Please log a Feature/Problem Request (FPR) for this.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718128438.777479",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS Forms\",\n    \"question\": \"Alternatives to Update multiple tables in Dynamics with one POST. Using Core form components, wanted to get alternatives to PUT to multiple tables (nested) , related within CRM/Dynamics. Are there any limitations and best practices with Ability to PUT to multiple nested tables and concerns with Repeated panels and PUT requests for multiple tables update? Workflow integration seen as an alternative for multiple PUTs - what are the basic permissions and or any user profile we have that can be added or to be added?\",\n    \"answer\": \"Suggested customer to customize the submit action item and have their custom code. For workflow"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718109529.142409",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"The customer has reported an issue with the default checkbox component of the core components in AEM Forms as a Cloud Service. When using the default checkbox component, the Checkbox Value breaks validation with no interaction. When checking and unchecking the value, it doesn't return to its default state but shifts to an undefined value.\",\n    \"answer\": \"By default, we do not preserve the unchecked value. If the user wants to send a value even when it is unchecked, they need to select 'Preserve Uncheck State Value' and set its value same as default, in the authoring settings. Default value"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1718083068.253269",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp\",\n    \"component\": \"Adobe Marketing Cloud\",\n    \"question\": \"we have been trying to preconfigure the JSON schema to map to custom adaptive form components using the example below. But instead of picking the field from '/apps/somefolder/....' the form field is always picked up from the 'libs/fd/....' or 'core/...' paths\",\n    \"answer\": \"Product team has advised us that this feature is not yet supported in core-component based forms and it only works in foundation-based forms. They have asked us to create a support ticket to enable this use case.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717979557.860269",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms and Signing\",\n    \"question\": \"Fragments not resolving when using Output service OSGI API. Customer experiences issues with fragment references in XDP not resolving correctly.\",\n    \"answer\": \"To resolve the issue, it is crucial to set the ContentRoot correctly when calling outputService.generatePDFOutput(). The ContentRoot should be the top-level directory containing the main XDP and fragment folders. Avoid using absolute paths or relative paths pointing to upper-level folders. The referencing path in the main XDP should be relative to the ContentRoot. Additionally, the templateName should be the full path of the main XDP. Ensure that the SOM expression in"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717645451.920519",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"Forms\",\n    \"question\": \"Form submissions result in a 503 error when the backend takes longer than 15 seconds to respond. The issue only occurs in the production environment and not in stage or other environments. The error seems related to the Fastly CDN.\",\n    \"answer\": \"The first-byte timeout for the CDN has been increased to 60 seconds by the SKYOPS team. Despite this, the issue persists intermittently. Further investigation is required through the SKYOPS ticket to ensure the new timeout settings are applied correctly to all CDN nodes. The customer is advised to optimize submission time under 15 seconds in future releases.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717520870.943819",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Discount Tire\",\n    \"component\": \"AEMaaCS\",\n    \"question\": \"Unrecognized error entries in log after AEM's auto upgrade to build version 16461. Errors related to services like CloudStorageSubmitActionInserter, ThemeOmniSearchHandler, FormsAndDocumentOmniSearchHandler, FDMOmniSearchHandler, and ScriptCacheImpl not being initiated.\",\n    \"answer\": \"This is a known issue. The JIRA ticket FORMS-14340 is in progress. The issue is fixed for CloudStorageSubmitActionInserter, but pending for OmniSearchHandler classes. There's a dependency on other components to complete their migrations. Migration seems to be the next step to"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717517740.099189",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"DOW\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer is using AEM Forms as a cloud service with the Foundational component. In the adaptive form from the foundational Component when we check the properties of the Form Container, in the prefill service there is NONE option. Even if we choose the NONE option, the guideContainer.af.prefilldata.json is getting loaded. The customer would like to remove this class and does not want it to be loaded with the Form. Additionally, the customer is concerned about data fetching and the possibility of returning sensitive data.\",\n    \"answer\": \"Currently, the prefill call attempts to fetch prefill data for the form (if any)"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717470076.154249",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Customer is trying to switch from using Forms API to OSGI API on AEMFaaCS but is facing challenges. They are getting an error related to template resolution.\",\n    \"answer\": \"The customer should ensure that the images referenced in the XDP are present at the relative path in the repository. They should also add the maven dependency for resource resolver and modify their code to set the resourceResolver while calling the API. The issue was resolved after making these changes and modifying the way XML data was fetched.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717084333.395159",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Date picker field and Rule editor\",\n    \"question\": \"The customer reported that when using the date picker field with the rule editor and then clicking on 'when' to create a rule, it allows dragging and dropping an element or function in the option. However, this does not work correctly and seems to be a bug. If it is a known behavior, the customer would like to understand why the options are available in the first place and why it is not disabled if it cannot be used.\",\n    \"answer\": \"Rule editor with 'when' option should not allow dragging and dropping an element or function. Selection of 'when' should only"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717084222.839559",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Validation on the fields not working. The customer has reported the issue with validation on different fields like number and date picker. When validation fails, the field value needs to be changed to pass the validation, not just tab out of the field.\",\n    \"answer\": \"OOTB, if the field value is changed and when it is focussed out, the constraints are again re-evaluated. If they need a custom behaviour, they would have to create a custom component. The form was updated and seems to work. Additionally, validation rules were applied to both the start date and end date to"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717084077.560029",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Date Picker Field\",\n    \"question\": \"When using the date picker field with Core Components, the maximum date validation allows selecting dates beyond the maximum date set. Additionally, applying a rule with the rule editor overrides the maximum date validation.\",\n    \"answer\": \"This behavior is not supported out-of-the-box and requires customization of the date picker core component. A ticket (FORMS-14477) has been logged for this issue. As a workaround, use custom functions and handle invalid events. Ensure the maximum date format is correct (e.g., max=\\\"2024-05-28\\\"). For the feature request, a new FPR"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1717043175.346369",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Customer is trying to replace their test-users with service user(aflac-service-user-service) by which they would like to find out 'work item' and 'resume' a workflow. The service user is not able to find the workflow workitem or resourceResolver.\",\n    \"answer\": \"The issue was resolved by ensuring that the correct service user mapping configuration was provided. The customer was not passing the mapping config correctly and was passing service user detail instead of subservice details. Passing the correct values worked for them.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716958862.630769",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Customer has a soft launch and Go-live planned in the starting June and they see issue after the new release. They request to pause automatic updates to our Stage and Production environments until next communication.\",\n    \"answer\": \"The RO updates have been paused by the CEATF91JT team.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716953976.537489",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"Forms\",\n    \"question\": \"Form Creation failing after the 2024.5.16461.20240524T172309Z update. Authors are failing to create Form on Dev / Test environment.\",\n    \"answer\": \"The issue is due to the presence of a protected jcr:uuid property in the template initial content. To resolve the issue, remove the jcr:uuid from the template initial content source file (.content.xml). Additionally, the customer validated a workaround by first publishing the template explicitly, then creating new forms with the template. They also updated their filter code to not replace the template for the time being.\"\n}\n"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716874268.459769",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"Numeric fields Component\",\n    \"question\": \"Once you click on submit button the field is not highlighted and the user is not able to view the mandatory error message when the Number Type is set to Integer.\",\n    \"answer\": \"This issue has been fixed as part of core-forms-components-reactor-3.0.30. A bug was logged and confirmed at https://jira.corp.adobe.com/browse/FORMS-14701.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716581112.580749",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms and Signing\",\n    \"question\": \"The customer has a query about pipeline ID in cloud manager. As there are aio commands to create an execution using Adobe CLI, but it works if the pipeline ID already exist. The customer is seeking help about how they can create a new pipeline ID using automation using Adobe CLI? Also, they are observing errors during executing commands from Octopus deployment server. They have configured the config.json file on the deployment server with actual values (ex: - client id, client secret etc.)\",\n    \"answer\": \"This was resolved after logging a SKYOPS.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716578761.522059",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms and Signing\",\n    \"question\": \"Pipeline taking a long time to run (35 to 45 minutes), seeking support to make it more efficient or split it into smaller builds.\",\n    \"answer\": \"This is not configurable. Suggest reaching out to the cloud manager team for further assistance.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716562975.463799",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"General Motors\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Customer would like to know why Code editor was removed (is not present) on AEMFaaCS. Additionally, they are working on creating custom rules which can be applied through a clientlib, but would like to know their other feasible options since their previous rules written in Code editor are also not functional.\",\n    \"answer\": \"The code editor was removed from the cloud service due to security concerns. You can make use of migration tool to convert code editor scripts into custom functions in client library. (https://experienceleague.adobe.com/en/docs/experience-manager-cloud-service/content/forms/setup-configure-migrate/migrate"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716519442.607589",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"AEM Adaptive Forms - Panel Component\",\n    \"question\": \"Issue with Radio Button component in Repeatable Panel where option selected in Radio of Panel [1] is deselected when Radio of Panel [2] is selected.\",\n    \"answer\": \"This issue has been logged as a bug and resolved in the release available at https://github.com/adobe/aem-core-forms-components/releases/tag/core-forms-components-reactor-3.0.26. The customer has been informed.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716483294.075359",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State of Pennsylvania Office of Administration\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Customer has queries on upgraded/releases deployed to AEMFaaCS, specifically about avoiding surprises and issues during Adobe Maintenance Release and Feature Release, pausing their instance, and establishing a process for rolling out releases in dev and test environments before PROD.\",\n    \"answer\": \"Raised SKYOPS-77879 for pausing the instance. Automated update process is established; no manual approvals are required. Releases go automatically on the same day for dev, then stage, then prod. DEV instances can be updated automatically earlier. Follow-up on enrolling the customer in special groups 30/40 to manage updates"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716471426.005559",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"United Parcel Service\",\n    \"component\": \"AEM Adaptive Forms\",\n    \"question\": \"CC and BCC not working in AEM Adaptive Forms. The OOTB option available in the Adaptive Forms for adding BCC and CC for sending email on form submission is not working. The 'To' recipient is not able to see the CC and BCC fields in mail.\",\n    \"answer\": \"The issue has been discussed with the security team and a SKYOPS case was raised. The Jira Number FORMS-14755 was created and the issue is now closed.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1716260303.030539",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Unable to display edit and set date with required format. Issues include: 1. Value resets to previous value when typed directly. 2. Pop-up calendar widget shows date instead of month and year only. 3. Widget changes to an HTML type widget look. 4. Value persisted is in the expected format but sent data includes the date.\",\n    \"answer\": \"A bug has been logged and assigned. The issue is replicable on in-house instance with custom date patterns like MMMM/y.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1715911854.529959",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"Adaptive Forms\",\n    \"question\": \"Customer wanted to know if there is a way to hide the default 'Product Canvas theme' or set a default template theme to a project-specific theme created using the frontend pipeline instead of the Canvas theme getting selected by default.\",\n    \"answer\": \"Ensuring that a custom theme named 'x' is automatically chosen by default when practitioners create a form. Are you inquiring about how to achieve this?\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1715851338.208409",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"AEMaaCS\",\n    \"question\": \"Date field validation does not work with core components. The customer is using core component template for forms and core form components. Enter two date picker core components and place them on the page - name them as start and end date. At end date add a rule for validation. Ensure you click the wrench icon and set a custom message in the 'script validation message field'. When end date is less than start date, the validation does not work. Ideally, dates should be compared easily. The same validation is working correctly with number field.\",\n    \"answer\": \"Logged Jira: https://jira.corp"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1715280132.711519",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Bancolombia\",\n    \"component\": \"Forms API (generateDoR endpoint)\",\n    \"question\": \"CORS error is presented in the developer console of the browser preventing the API from being consumed.\",\n    \"answer\": \"The issue was resolved by correctly configuring the allowed hosts with port numbers and ensuring the correct values were passed in the configuration file.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1715242453.329219",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"HDI AG\",\n    \"component\": \"DoR\",\n    \"question\": \"Adaptive Form submissions fail intermittently because of prolonged DoR generation. This results in a timeout for the client, leading to the same data being submitted multiple times.\",\n    \"answer\": \"The issue is suspected to be due to the IMS issue, where the time of DoR generation is nearly 2 minutes. The IMS auth fixes have been merged, but the updated DoR cannot be deployed until FORMS-14235 is resolved. As a temporary measure, it was suggested to disable the IMS route for affected customers. The fix has been rolled out and deployed to all environments of this customer. Customer's environment got overridden"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1714665760.970529",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SANTANDER CONSUMER USA Inc.\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Timeout in target request flow. Errors in publish pod during IMS authentication/authorization. Customer suggests it's not an APIGEE issue.\",\n    \"answer\": \"Raise a SKYOPS ticket to investigate the issue further by AEM On-Call engineers. The issue has been fixed in the latest cloud release. Upgrade to the latest version.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1714458681.328389",
    "source": "slack",
    "messages": "{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"AEM Forms content tree (left panel) not updating after changing the component order but content getting rearranged. The issue appears to be with the new form version '15977'.\",\n    \"answer\": \"Customer needs to be rolled back to the previous version as the issue seems to be with the '15977' Release. A sky-ops will be raised to perform the rollback. Customer is yet to go live and is in the UAT phase with a go-live date of 15th May. The rollback will start with the DEV instance first.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1714431242.261139",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANCOLOMBIA\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"One of our customers integrated Adobe Analytics with the AEM Forms on Cloud. However, in the Analytics Report for the Form Submission, they can see much lower numbers. In the report, there are 200 submissions while in actuality the form is submitted around 2000 times. Requesting your input on this.\",\n    \"answer\": \"Logged a Jira for further analysis and marked as resolved. Jira link: https://jira.corp.adobe.com/browse/FORMS-14241\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1713906815.604129",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"State Of Pennsylvania Office Of Administration\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer reached out to us stating that after AEM Maintenance Release 2024.04.15977.1713462515820 was deployed on their servers, it caused issues with their forms on the website <https://iro.insurance.pa.gov/department-of-insurance>. Widgets are not showing correct step numbers and panels are not showing correctly.\",\n    \"answer\": \"Customer has tested after the rollback and the issue is now not happening post rollback. We decided to proactively rollback all the environments to the previous release to recover to a previously stable release. Maintenance Release Notes for 15977 will be updated accordingly"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1713902453.887059",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"AEM Adaptive Forms\",\n    \"question\": \"Users are facing an issue where Adaptive Forms are rendering blank and starting on the second page across all environments (Development, Stage, and Production) after a recent update. This problem was not present prior to the latest AEM Release Update which happened yesterday.\",\n    \"answer\": \"The issue started after an AEM Release Update, with no changes prior to the update. Support confirmed no error traces in the logs and that the pipeline build was successful. The solution was to roll back to the previous release.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1713811315.893859",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"The customer is trying to use prefill service for embedding the form in SPA but does not want AEM Forms to access the XML URL directly. They want to use GuideBridge for setting and getting form data, but setData only allows JSON, and using dataRef requires AEM server to call back into LPL systems.\",\n    \"answer\": \"The suggested approach is to configure a prefill service that retrieves the necessary form data using a generic prefill servlet. However, the customer's desired use-case of using GuideBridge to set form data is not supported. The customer needs to configure flexible port egress in the"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1713318942.830519",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms and Signing\",\n    \"question\": \"After upgrading to 2024.4.15860.20240410T113939Z, customer is reporting that their DEV environment has become unstable, seeing 20,000+ lines of blocks from OOTB bundles continuously rolling and AEM DEV PUBLISH is not able to serve generate PDF functionality. No logs were being recorded after 16.04.2024 19:46:29.101.\",\n    \"answer\": \"Customer has confirmed that PDF generation functionality is working fine now. Though they are still observing the OOTB exception stack trace. The issue has been marked resolved since"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1713289344.514929",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"Sign Document\",\n    \"question\": \"The customer is trying to mimic 'Sign Document' component in a customized way due to the business requirement that OOTB doesn't support multiple documents as input to be sent for signature within a single agreement ID.\",\n    \"answer\": \"The solution involves sending multiple documents by adding them as attachments in Adaptive form, which are supported in the workflow step. Additionally, parameters such as Days Until Deadline, Reminder Email Frequency, and Signature Process cannot be parameterized in the workflow and require enhancement. For pausing the workflow, the custom step should be marked as autoadvance"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1713244366.573649",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF AUCKLAND\",\n    \"component\": \"Forms\",\n    \"question\": \"Updating form properties shows technical success message page instead of the usual flow. This issue is present on all environments (DEV, STAGE, and PROD) from the time of instance creation.\",\n    \"answer\": \"The issue is not reproducible on internal AEMFaaCS instances with the same release. Please check the issue on a fresh environment with a fresh repository (No customer code in VSTS) to help in isolating the issue. Access has been granted to the environment for further investigation.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1712926179.394109",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"FISERV SOLUTIONS INC\",\n    \"component\": \"Forms\",\n    \"question\": \"Not able to create Form using adaptive form option in form console. Customer is trying to use Forms capability but does not see any default template and Themes. Customer raised a question if they can edit the existing archtype.properties file where forms enrollment is 'n' and change it to 'y' to enable the capabilities.\",\n    \"answer\": \"To deploy the Forms component, the customer can create a new project with the help of Maven as forms enabled and push the same to the environment. Code can be simply moved/copied from one project to another. However, changing the archtype.properties file from 'n'"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1712597021.953929",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EXPRESS SCRIPTS HOLDING COMPANY\",\n    \"component\": \"AEM Adaptive Form\",\n    \"question\": \"Issues with prefilling AEM Adaptive Form in headless mode with an external react application. The prefill service works when the form is rendered in AEM as a standalone form but not with the external react application.\",\n    \"answer\": \"The starter-kit doesn’t support prefill. A PR has been raised for the fix. The customer can take those changes in their code and try it out by defining an environment variable `DATA_API` which would be `<https://aem-endpoint/adobe/forms/af/data>`.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1712340002.248509",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Issues when attempting to reference a hostname stored in an environment variable within Adobe Cloud Manager. Specifically, while using this hostname directly in an OSGi configuration within Customer AEM instance works flawlessly, attempting to reference the same hostname from the environment variable within the OSGi configuration leads to an UnknownHostException.\",\n    \"answer\": \"It's most likely an issue with customer's code that is reading this OSGi config. If it's using configadmin to list the configs, then it should call getProcessedProperties method on the Configuration object to return the replaced values in the placeholders. The customer should use OSGI APIs instead"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1712296725.582939",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Suncorp - Adobe Marketing Cloud\",\n    \"component\": \"Frontend Pipeline\",\n    \"question\": \"Customer reported an issue while running front end pipeline for theme deployment. The pipeline passes the unit and build stage but fails at deploy step. The same codebases and UI packages are getting installed on other programs successfully, but the issue occurs only in this specific program. There is no issue while running the full pipeline, the issue is occurring with this specific frontend code.\",\n    \"answer\": \"The issue appears related to the IP allowlists configured by the customer on author. This issue is not related to Forms. The customer was advised to follow the steps mentioned in a previous thread, but they were reluctant."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1712241696.072829",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AJILA\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Connection timeout after GET request to third party service. Customer would like to know if there is a firewall in place that does not allow HTTP requests (and allows only HTTPS) or blocks all ports except the default (80).\",\n    \"answer\": \"All ports except 80 and 443 are blocked. If they are trying to connect on ports other than 80/443, follow the provided link to configure flexible port egress.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1712129030.751029",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANCOLOMBIA\",\n    \"component\": \"AEM Forms as a Cloud\",\n    \"question\": \"The customer is having an issue when trying to configure a field that should add values of other fields in an adaptive form (core components). They are seeing an error message saying 'Failed to load all custom functions.'\",\n    \"answer\": \"The team is currently addressing this issue, as indicated in the GitHub issue comments.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1711977194.898779",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"FISERV SOLUTIONS INC GBS\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"The customer has enabled the AEM Forms add-on in their AEM as a Cloud Service environment. After this change, the deployment pipelines have started failing. Logs indicate that removing form code and instances from CRX/DE did not resolve the issue.\",\n    \"answer\": \"Support has ensured that the following steps have been performed: 1. Delete all Forms artifacts & Forms Folders from CRX & remove specific folder structures from CRX in the DEV environment. 2. Run Pipeline and check for any forms references. 3. Enable Forms. 4. Run Pipeline to deploy"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1711737462.958659",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"CITY OF PHOENIX\",\n    \"component\": \"AEM Forms PowerAutomate\",\n    \"question\": \"Customer is getting an error submitting form to PowerAutomate Workflow using Core Components. They are receiving a 'Unable to obtain the flow URL for flow id' error.\",\n    \"answer\": \"The issue seems to be a cloud configuration problem. It is suggested to recheck the configurations. The form at /content/forms/af/test-forms/kevin-test/test-power-automate is configured correctly and submitting as well, whereas the form at /content/forms/af/test-forms/nina-tests/simple-test-flow has an incorrect 'Microsoft flow service' configuration. A JIRA ticket"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1711646123.727549",
    "source": "slack",
    "messages": "{\n    \"company\": \"\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"This message was deleted.\",\n    \"answer\": \"Issue Reason : AEMFaaCS\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1711601638.952369",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms and Signing\",\n    \"question\": \"Customer is trying to embed an Adaptive Form (AF) from AEMFaaCS on their consultworks webpage. All requests including guidecontainer and clientlibs are correctly called, but the CSRF token call fails and the webpage gets stuck on a spinning icon.\",\n    \"answer\": \"The issue was due to a polyfill on their SPA page, which was overriding XHR send and preventing the sending of cookies in the token.json call, causing Cloudfront to block the call. The customer investigated and confirmed that making changes for the XMLHttpRequest resolved the CSRF token issue. Additionally, the customer applied a"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1710925501.714439",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF ADELAIDE\",\n    \"component\": \"FaaCS Environment\",\n    \"question\": \"We need to understand a way on how this additional theme can be removed from environment?\",\n    \"answer\": \"You can suggest customer for removal of the additional theme deployment node present at /conf/global/frontend/deployments. This can be achieved by either of the following two ways: 1. Using crx/de 2. In customer code repo (VSTS), add the filter path for theme deployment node in ui.content package. As there is no corresponding node structure in the src but filter only, the node should be deleted during pipeline execution. Customer confirmed that after adding filter (#2 in"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1710445434.218589",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANCOLOMBIA\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"Adaptive Form custom theme doesn't work in a core components form. It seems we can't replicate the theme to a publish instance and the theme. Whenever we try to publish a Form, in logs we do not see the themes getting published from quick publish option. Will the theme need to be published separately, will not be published with Forms quick publish? In publish environment in Content repository we do not see the required and custom Theme available.\",\n    \"answer\": \"The theme configuration should be accessible on the publish instance following the successful completion of the frontend pipeline. Theme is stored in Azure Blob as static content when deployed using the"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1710227894.171669",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"The 'Select Folder' option is not visible when trying to create a form by clicking on 'Select Folder' when the browser zoom is above 75%. The issue occurs when trying to save the form in a different location and the 'Select Folder' and 'Cancel' buttons are not visible if the resolution of the browser is set to 100%.\",\n    \"answer\": \"The issue was reproduced on the 2023.12 release, and it was confirmed that the customer is on the latest release. A JIRA was raised for the issue (https://jira.corp.adobe.com/browse/FORMS"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1709270671.300909",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"THE UNIVERSITY OF ADELAIDE\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Customer is unable to deploy their theme via Front End Pipeline in Cloud Manager due to an InvalidStatusCodeRuntimeException error.\",\n    \"answer\": \"The root cause was identified as an IP allowlist configuration that restricted access to the author pod. The solution suggested by the CMGR team was to disable the allowlist for the Author pod and re-run the pipeline. The Customer was able to run the pipeline after removing the IP allow list. The Customer also inquired about how to run the pipeline with the IP allow list configured, and a follow-up with the CMGR team is in progress.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1709126890.433349",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"Forms\",\n    \"question\": \"Deloitte is reporting an issue with the accessibility of Adobe Forms (AF) while using the drop-down field. The screen reader reads for the dropdown as '*Combo box Collapsed required*' and does not read the label of the drop-down field.\",\n    \"answer\": \"A JIRA has been logged for the issue (https://jira.corp.adobe.com/browse/FORMS-13543). Further investigation is required to determine if this behavior is as designed or if a feature request is needed.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1708951053.668639",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SIGNAL IDUNA LEBENSVERSICHERUNG\",\n    \"component\": \"Forms\",\n    \"question\": \"While trying to embed any foundation based Forms (with wizard panel lay out) in a page with AEM Form Container, it breaks. This only happens when we author the form with wizard layout in root panel configuration. If you reload the page it gets fixed, but if we again reconfigure the AEM form container and save it, the forms start breaking again.\",\n    \"answer\": \"The issue is occurring when the form is in non-iframe mode, which is the default for forms embed component. This issue is not occurring when you use 'preview as published' in the sites"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1708949785.372399",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SIGNAL IDUNA LEBENSVERSICHERUNG\",\n    \"component\": \"OOTB Forms Themes\",\n    \"question\": \"Themes are not opening in edit mode and keeps loading.\",\n    \"answer\": \"Clearing the browser cache resolved the issue in Chrome.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1708071714.816859",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"CommonSpirit Health\",\n    \"component\": \"Forms\",\n    \"question\": \"Customer is not able to edit any of the existing AF on their instance in AEMaaCS environments.\",\n    \"answer\": \"The issue is caused by a sites page editor hook client library. Removing the custom hook client library (/apps/csh-aem-core/clientlibs/clientlib-authoring) will fix the issue.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1708070736.182189",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"INPS\",\n    \"component\": \"AEM Forms aa CS\",\n    \"question\": \"Unable to create a Production environment and getting an error indicating that tenant credits have been exceeded. Also, they see the same error while changing the Go-Live Date.\",\n    \"answer\": \"The existing program has consumed their credit. They cannot add any additional programs. To create a production instance for program 127204, they need to free the used forms credit. This involves unchecking 'forms' on the 41554 program and starting a production pipeline. The credit will be freed after the production pipeline deployment is finished.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1707813401.481179",
    "source": "slack",
    "messages": "{\n    \"company\": \"Colonial First State\",\n    \"component\": \"Adaptive Form\",\n    \"question\": \"Hidden components of adaptive form are visible on AEM pages, but work fine when previewing the form separately. Issue started suddenly and is reproducible in all environments.\",\n    \"answer\": \"The issue is due to missing client libraries in the page policy. Adding the necessary client libraries to the page policy resolves the issue. It is documented that these client libraries are required to be included in the page policy. The customer should verify if they have transitioned from iframe mode to non-iframe mode or if they have modified template settings for the page.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1707142977.657319",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"VERGÖLST GMBH\",\n    \"component\": \"Form Container Component\",\n    \"question\": \"One of our ULTIMATE customers has raised queries on what content is stored on Adobe Infrastructure based on Submit action of Form Container Component. They want the physical address/infrastructure information to include in their Legal documentation. 1. If we use 'Mail' action in form component, will it be stored on Adobe Infrastructure or in CRX Repository? If yes, how often it could be removed from Adobe Infrastructure and what is the purpose of it? 2. If we use 'Store Content', will the content be stored in Adobe Infrastructure? If this is correct, could you please provide Adobe"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1706707918.720119",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"Adaptive Forms\",\n    \"question\": \"Accessibility concern where the Drop-Down component does not expand with the Enter key.\",\n    \"answer\": \"An HTML select element should open the menu using arrow keys or the spacebar (not the Enter key). The Enter key should be reserved for performing the action in the select menu. This information was shared with the customer, but they still request the Drop-Down to expand with the Enter key.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1706707768.021659",
    "source": "slack",
    "messages": "Since the provided message has been deleted and there is no further content to analyze, it's not possible to extract the required knowledge triples. If you have another thread or message content, please provide it, and I can help you format the output accordingly."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1706685789.963039",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"terms & condition component\",\n    \"question\": \"ScreenReader tabbing journey for terms and conditions is incorrect. The order of the focusable elements should be Checkbox -> terms of use -> privacy statement, but it is currently Terms of use -> privacy statement -> Checkbox.\",\n    \"answer\": \"This issue has been replicated in the in-house setup of AEM Forms 2023.09.11.00-231000 local SDK. Further suggestions or solutions are being sought to address the tabbing order problem.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1706626130.073519",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"General Motors\",\n    \"component\": \"Adaptive forms\",\n    \"question\": \"When trying to publish a site page, the 'Manage Publication' option allows choosing between preview or publish environments, but this choice is not available for forms. Is this expected behavior?\",\n    \"answer\": \"This is being discussed internally as a feature. A workaround is available with caveats. A Feature Pack Request (FORMS-12869) has been created to address this, and further discussion is ongoing.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1706538151.845079",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"LPL Financial\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Few users are unable to create adaptive form. Error message says that there was an issue connecting to the server and to try again later. In dev tools network log, there are several 403 errors reported.\",\n    \"answer\": \"The issue was resolved after updating the configuration for the referrer filter. Post that, the users were able to log in to the AEM and create forms.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1706521685.882159",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EXPRESS SCRIPTS HOLDING COMPANY\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Loading of an AEM form is taking too long. The customer would like to know if there is a better way to achieve this use case to help with loading time, or if there is a way to find the approximate time of the scripts that are getting loaded and their sub-tasks.\",\n    \"answer\": \"To ensure that the form scripting and details are called after the DOM is ready, you can modify your script to execute the `loadAdaptiveForm` function after the DOM has fully loaded using the `DOMContentLoaded` event. Additionally, for the issue where scripts are executed before the"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1706521012.520049",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BC HYDRO\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"The customer is trying to use AEM Forms for the cloud environment. In DEV they see Forms is provisioned and needs to run the pipeline for Forms to be visible. However, in RDE environment, the forms are visible even without running the pipeline. Could you please help if we are missing anything?\",\n    \"answer\": \"For dev/stage/prod environments, the pipeline should be run once to enable Forms. Issue Reason: AEMFaaCS\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1706154702.533529",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Brisbane City Council\",\n    \"component\": \"Forms Core Component\",\n    \"question\": \"Issues with Forms Core Component Build Pipeline in Cloud Manager for DEV environment. With Core Components Version 2.0.12, the build passes but reports critical issues in Code Quality/Scanning step. With Core Components Version 2.0.74, no issues in Code Quality step but the build fails at the Deploy step with multiple errors in Splunk.\",\n    \"answer\": \"This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1704483345.946179",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NAVY FEDERAL CREDIT UNION (NFCU)\",\n    \"component\": \"DCS Forms\",\n    \"question\": \"NFCU has raised an issue with their cloud server. They are testing API calls related to the DCS Forms project on Postman by using the local Token via developer console. For the author, they are seeing 200 responses and for the Publisher they are seeing a 403 error indicating that the user should be a member of the forms-users group to use the API.\",\n    \"answer\": \"To resolve the issue, NFCU should publish/activate the user and forms-users group on the author. This will replicate the user and its group membership in the forms-users group on"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1704366063.670099",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AJILA\",\n    \"component\": \"Forms\",\n    \"question\": \"Our customer is creating 2 environments under the same program (this program has FORMS added as a solution). If the customer creates an RDE environment, it is forms enabled by default. However, if the customer creates a DEV environment, forms are not enabled on the DEV environment. Any suggestions on this?\",\n    \"answer\": \"For dev/stage/prod environments, the pipeline should be run once to enable Forms.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1704365926.685439",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"Forms\",\n    \"question\": \"Unable to submit form due to placeholder text changes. The first value from dropdown fields is behaving as placeholder text, preventing submission when selected.\",\n    \"answer\": \"The issue is recognized as an AF runtime problem. It was reproduced locally with SDK 2023.09.11.00-231000. A Jira ticket (FORMS-12451) has been logged to address the issue. The fix is not present in the shared server; a new server post dated after October 10th, 2023, should be created. The fix will be provided in AF2.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1703218903.407989",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"PACIFIC GAS AND ELECTRIC CO\",\n    \"component\": \"AEMFaaCS\",\n    \"question\": \"Customer is looking for content package from PROD Auth for the below paths from Nov10th and Dec 18th dates. Is there a date-wise backup over AEMFaaCS? Customer wanted form last previous month (> 7 days) and at a particular date.\",\n    \"answer\": \"Restore can be done to any point in time in the last 7 days. It is only allowing a backup of the last 7 days, and restoring for a date earlier than 7 days is not possible.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1702665735.932849",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"AMERICAN FAMILY LIFE ASSURANCE COMPANY OF COLUMBUS - AFLAC\",\n    \"component\": \"AEMFaaCS Workflow Model\",\n    \"question\": \"Customer is looking for an explanation if the workflow model migration behavior from local SDK to AEM Forms cloud instance is expected or if they are missing something.\",\n    \"answer\": \"On instance start-up, the workflow engine tries to sync the models shipped OOTB from /libs to /var. However, custom models from /conf are not synced to /var due to a miss in the current implementation. Until a fix is provided, add the /var/workflow/models/&lt;modelRelativePath&gt; to the git repository from the"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1701869373.976589",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"TRANSURBAN\",\n    \"component\": \"Forms\",\n    \"question\": \"Forms not showing text fields in live site. The form is loading fine on author but on live site text content objects are missing.\",\n    \"answer\": \"This thread has been closed. No further action is required.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1699978178.911819",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Navy Federal Credit Union\",\n    \"component\": \"AEC Forms\",\n    \"question\": \"Egress IP for AEC Forms environment keeps changing, causing failures with form submissions in non-prod environments. Manual addition of new IPs to Azure Storage Allowed IPs list is needed to resolve the issue.\",\n    \"answer\": \"Adobe Support has logged a JIRA (SKYOPS-65166) to investigate the issue further. Mayank (EM for FDM) has been looped in to work with the Networking team to find a resolution. All relevant information has been shared with the customer.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1699843365.110269",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Datepicker\",\n    \"question\": \"The year displayed in datepicker calendar is picking year as per en calendar and not thai calendar.\",\n    \"answer\": \"Resolved and private build is shared with customer.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1699321461.651299",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Datepicker\",\n    \"question\": \"Datepicker is not picking language from browser. Therefore even when our browser is set to different language, datepicker displays day, months etc in en and not specific language set in browser.\",\n    \"answer\": \"Issue resolved after browser cache has been cleared since changes are in the client side code. No further action is required.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1699317405.565129",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"DOW\",\n    \"component\": \"Forms\",\n    \"question\": \"Form Authors cannot edit forms\",\n    \"answer\": \"Issue Reason: ${body.actions[0].selected_option.value}\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1699316935.168329",
    "source": "slack",
    "messages": "{\n    \"company\": \"DOW\",\n    \"component\": \"Forms\",\n    \"question\": \"Form Authors unable to publish forms because they reference css items in the /apps/ in crx/de\",\n    \"answer\": \"Issue Reason: AEMFaaCS\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1698939214.579709",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"NAVY FEDERAL CREDIT UNION\",\n    \"component\": \"Forms\",\n    \"question\": \"Not able to deploy custom Themes to Forms Environment. The customer is planning to use the default themes OOTB but they mentioned that they tried testing to deploy custom themes, but they see theme gets deployed but are not visible in UI when trying to choose custom theme.\",\n    \"answer\": \"Scheduled a call with the customer and discussed the issue in detail. The issue was fixed once the customer upgraded to the latest version of the October release.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1698817322.986889",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BankOfThailand\",\n    \"component\": \"Radio button\",\n    \"question\": \"Rules not working for the radio button component. When defining rules on the radio button, it doesn't show the component name for which rules need to be defined. The issue is reproducible on the latest release 2023.10.14029.20231020T111912Z-230902 but not in older releases.\",\n    \"answer\": \"The issue has been acknowledged and marked resolved. It was noted that the problem does not exist in older releases.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1698683978.068699",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"CAPELLA\",\n    \"component\": \"GuideRuntime\",\n    \"question\": \"JS not minifying in prod and impacting application performance. Errors encountered while loading JS in the browser.\",\n    \"answer\": \"Issue fixed in a PR that is not present in the customer's instance. Suggested workaround: In `HtmlLibraryManagerImpl.cfg.json` specify the jsProcessor with as 'min:gcc;languageIn=ECMASCRIPT_2015', then restart the instance or rebuild the clientlib. This should unblock the customer for now. Further fix to be included in the next release.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1698323972.920679",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"CONEXIO GROUP AMERICAS PARTNER SANDBOX\",\n    \"component\": \"Stage pipeline\",\n    \"question\": \"The customer has started running the stage pipeline and right in between the environment got into a hibernated state. Now the deployment to stage got stuck and it seems that the stage environment is out of service.\",\n    \"answer\": \"This case has been promoted to P1 and SKYOPS has been raised. The thread has been marked resolved by the responsible party.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1698204053.629639",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Forms\",\n    \"question\": \"Multiple keys with multiple values not allowing\",\n    \"answer\": \"Workaround shared with the customer: Have a panel with static text, followed by 4 horizontal radio buttons, styled accordingly.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1698203962.009899",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Forms\",\n    \"question\": \"1. On field selection the form gets scrolled up. 2. We are getting the following console error while calling next/prev function: this.widget.focus\",\n    \"answer\": \"Both these issues are fixed with the release of Core Forms Components Version 2.0.64. Customer is testing these issues and will get back in case of any issues.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1697743709.032839",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"STATE OF PENNSYLVANIA OFFICE OF ADMINISTRATION\",\n    \"component\": \"AEM Cloud Service forms\",\n    \"question\": \"Missing forms template and sample forms within the Cloud Service Authoring environments. Can you confirm availability of forms product within our cloud service and can you confirm if forms sample template and forms can be added in the cloud service?\",\n    \"answer\": \"Scheduled a call with the customer and provided all the information to them. The customer asked to close the case as all queries were answered.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1697609990.629999",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"SUNCORP\",\n    \"component\": \"AEM Adaptive Forms\",\n    \"question\": \"We are having trouble in publishing the AEM Adaptive Forms. We have debugged it from our side and below are the findings - On Publish action - before Publishing, the form request for all related assets for publish via /libs/fd/fm/content/basemanage.json?func=getRelatedAssetsToPublish&amp;nodePath=%2Fcontent%2Fdam%2Fformsanddocuments%2Faami-forms%2Ffridayz-live, which results in an error. Log trace points to the below method which has throw the repository exception, com.adobe.aem.formsnd"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1697609006.326279",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Deloitte\",\n    \"component\": \"Form\",\n    \"question\": \"Unable to submit form when Google reCaptcha is enabled\",\n    \"answer\": \"The issue stands resolved as the customer postponed the production go-live to 16-Nov (tentatively) and would be moving to a new release version with a fix. The issue was due to a conflict with the Field Toggle functionality recently released for the reCaptcha core component. Users were unable to submit forms with reCaptcha enabled because the configuration parameter for AF was not mapped to /conf/global.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1697451649.748739",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Forms\",\n    \"question\": \"With latest cloud service and forms, the Submit functionality is breaking. The data is getting saved to the server, but there is an error in the response from AEM. The same code works fine with the older cloud service.\",\n    \"answer\": \"Issue resolved at customer end. Issue was caused by non-core component involvement in the Adaptive Form. It will be fixed in the 2023.11.0 release.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1697451370.644359",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Radio Button\",\n    \"question\": \"We are using Radio button components as well as some custom components overridden from radio button. We have a requirement to provide uncheck functionality for Radio button. We tried to modify UI and js to have uncheck functionality, but the Rules, Validations and form values are getting impacted.\",\n    \"answer\": \"This thread has been marked resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1697124817.545029",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"EXPRESS SCRIPTS HOLDING COMPANY\",\n    \"component\": \"Forms\",\n    \"question\": \"The customer is trying to publish any form from author to publish instance, but it's failing with the popup message 'Unknown error occurred'. There are no error messages in the logs, but network logs show 403 error. The same error comes up when we try to unpublish any form.\",\n    \"answer\": \"The CRSF token was coming out to be invalid. The issue was found and corrected.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1697124710.909649",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"DELOITTE\",\n    \"component\": \"Forms\",\n    \"question\": \"Unable to submit form when Google reCaptcha is enabled\",\n    \"answer\": \"A new private release was shared with this fix. Marking this thread as resolved.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696877609.734039",
    "source": "slack",
    "messages": "{\n    \"company\": \"BANKERS HEALTHCARE GROUP, LLC\",\n    \"component\": \"Forms\",\n    \"question\": \"Conditional Rules are not working with nested forms\",\n    \"answer\": \"Reference Ticket# E-001034159 and related JIRA tickets FORMS-11378, FORMS-11379\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696877499.504799",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"MAURICE BLACKBURN PTY LIMITED\",\n    \"component\": \"Prod publish form\",\n    \"question\": \"css class 'js-submit-data-layer' not loading in few Prod publish forms\",\n    \"answer\": \"Please select capability for your question\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696877364.320739",
    "source": "slack",
    "messages": "{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Submit\",\n    \"question\": \"get response to handle session | Thankyou message popup\",\n    \"answer\": \"Issue Fixed, thread can be closed. Confirmed on email chain, Customer is able to generate a pop-up (with Thank you message) while submitting the form. Closing the Thread. This thread has been closed and marked resolved. No further action is required.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696877206.537199",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Form Schedule Publish\",\n    \"question\": \"Not Working\",\n    \"answer\": \"The fix of issue would be provided in November release 2023.11.0\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696877133.707439",
    "source": "slack",
    "messages": "{\n    \"company\": \"PACIFIC GAS AND ELECTRIC CO\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Accessibility issues\",\n    \"answer\": \"A Jira ticket FORMS-11826 has been logged for the issue with arial labelledby.\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696876887.061659",
    "source": "slack",
    "messages": "{\n    \"company\": \"BANKERS HEALTHCARE GROUP, LLC\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"Error on Copying the Checkbox component\",\n    \"answer\": \"Issue Reason: ${body.actions[0].selected_option.value}. Reference Ticket# E-000997731\"\n}"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696876816.549339",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Bank of Thailand\",\n    \"component\": \"CM\",\n    \"question\": \"Allowlist IP in CM\",\n    \"answer\": \"Issue fixed by configuring IP allowlist at customer CM, thread can be closed\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696876713.415889",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"BANKOFTHAILAND\",\n    \"component\": \"Set Focus\",\n    \"question\": \"Issue: Only working for TextBox and Pannel. Issue Reason: ${body.actions[0].selected_option.value}\",\n    \"answer\": \"The issue stands resolved as the fix has been provided with Core components release version 2.0.62. No further action is required.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696523285.368499",
    "source": "slack",
    "messages": "Since the input provided does not contain specific details such as the company name, component or feature mentioned, problem description, or resolution, it is not possible to extract the required knowledge triples. \n\nHere is an example of what the JSON output would look like if the necessary details were provided:\n\n```json\n{\n    \"company\": \"Example Company\",\n    \"component\": \"Example Component\",\n    \"question\": \"Example Problem Description\",\n    \"answer\": \"Example Resolution or Clarification\"\n}\n```\n\nPlease provide a more detailed Slack conversation for accurate extraction of knowledge triples."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696523175.783929",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Adobe\",\n    \"component\": \"AEM Forms\",\n    \"question\": \"The customer requires third party accessibility testing for release launch. When we submitted the AEM Forms, the third party flagged the following as non-compliant with accessibility: 1. Field-level error messages are bound to the corresponding fields using aria-labelledby. This causes conflicts with the existing usage of aria-label. Aria-describedby should be used for error text. This is observable for the following control elements: fields based on input markup, such as date picker, email, phone and similar. The same situation can be noticed also on additional controls such as radio buttons and checkboxes. 2. There are form controls with visual labels that"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696523082.038679",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"Not Specified\",\n    \"component\": \"Forms\",\n    \"question\": \"We are developing a new form and added a checkbox component. Later we copied the checkbox component and pasted it on the same form. But the form is throwing an error. It works fine if we create the second checkbox by adding the component manually instead of copying. This error occurs only when we copy and paste the checkbox.\",\n    \"answer\": \"The thread has been closed and no further action is required.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696522739.087869",
    "source": "slack",
    "messages": "Based on the input provided, it appears that the message content is missing or deleted, and there is not enough context to extract specific details regarding the company, component, problem description, or resolution. Therefore, it is not possible to generate a complete JSON object with the required information.\n\nHere is an attempt to structure the information that is available:\n\n```json\n{\n    \"company\": \"\",\n    \"component\": \"\",\n    \"question\": \"\",\n    \"answer\": \"This thread has been closed by an unspecified user. No further action is required.\"\n}\n```\n\nIf you can provide more context or a complete conversation, I would be able to generate a more accurate and detailed response for you."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696522537.433789",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"\",\n    \"component\": \"\",\n    \"question\": \"\",\n    \"answer\": \"This thread has been closed by ! No further action is required.\"\n}\n```"
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696522295.452709",
    "source": "slack",
    "messages": "The provided input does not contain sufficient information to extract the required details for the knowledge triples. The message indicates that a message was deleted, references a ticket number, and includes some generic phrases that do not specify a company, component or feature, or a clear problem description and resolution.\n\nHowever, here is a JSON object with placeholders to illustrate the format:\n\n```json\n{\n    \"company\": \"<Company Name>\",\n    \"component\": \"<Component or Feature>\",\n    \"question\": \"<Problem Description>\",\n    \"answer\": \"<Resolution or Clarification>\"\n}\n```\n\nIf you can provide a more detailed conversation or additional context, I would be able to extract and format the required information accordingly."
  },
  {
    "channel_id": "C05UWBPNSTF",
    "thread_id": "1696355552.577929",
    "source": "slack",
    "messages": "```json\n{\n    \"company\": \"\",\n    \"component\": \"\",\n    \"question\": \"\",\n    \"answer\": \"This thread has been closed by ! No further action is required.\"\n}\n```"
  }
]